//==================================================================================
//注：所有脚本开头，均需注明本脚本的大致说明文字
//
//
//客户端任务对话，【章回任务】第二卷支线
//==================================================================================

//【章回任务】
//第一编号为【卷】，每一张地图为一卷，每一卷的任务编号间隔数为200，第二编号段为【章】，每一卷暂定为三章，每一章的任务编号间隔数为40，附章间隔为20，最后多余20个编号。
//目前编号段规划，最大可至24卷，24*3=72章，即可以满足72张地图所需的章回任务，视后期任务需求，可挪用一部分的支线任务编号段

//■■■■■■■第一章■■■■■■■■■■■■■■■■■■■■

//■■■■■■■第一章■■■■■■■■■■■■■■■■■■■■

//■■■■■■■■■■■第二章■■■■■■■■■■■■■■■■

//■■■■■■■■■■■第二章■■■■■■■■■■■■■■■■

//■■■■■■■■■■■■■■■第三章■■■■■■■■■■■■

//■■■■■■■■■■■■■■■第三章■■■■■■■■■■■■
