//==================================================================================
//注：所有脚本开头，均需注明本脚本的大致说明文字
//
//
//客户端与服务端共用的脚本函数
//==================================================================================

//加载服务端与客户端共享脚本-----------------------------------------------------

//加载客户端与服务端的全局变量
Exec("./C_S_Final_Variables.cs");

//加载客户端与服务端共享的任务条件判断函数
Exec("./C_S_Mission_Need.cs");

//加载客户端与服务端共享的任务奖励函数
Exec("./C_S_Mission_Reward.cs");

//加载配方脚本
Exec("./C_S_Prescription.cs");

//加载分解与合成脚本
Exec("./C_S_FenJie_HeChen.cs");

//加载师门任务相关集
Exec("./C_S_Teacher.cs");
Exec("./C_S_Teacher_Condition.cs");
Exec("./C_S_Teacher_Door.cs");
Exec("./C_S_Teacher_Reward.cs");

//加载异宝觅踪任务相关集
Exec("./C_S_HideMap.cs");
Exec("./C_S_HideMapTJ.cs");
Exec("./C_S_HideMapXS.cs");

//脚本加载完成-------------------------------------------------------------------

//快速跳转入口，选中后使用F3即可，如果你不是用UE，那就帮不了你了

//■■■■■■■■■■■指定对象发送特效编号■■■■■■■■■■■■■■■■■■
//■■■■■■■■■■■获取任务的类型■■■■■■■■■■■■■■■■■■■■■
//■■■■■■■■■■■获取数个不会重复的随机数■■■■■■■■■■■■■■■■
//■■■■■■■■■■■玩家自己卜卦脚本■■■■■■■■■■■■■■■■■■■■
//■■■■■■■■■■■获取指定位的bit值■■■■■■■■■■■■■■■■■■■



//■■■■■■■■■■■指定对象发送特效编号■■■■■■■■■■■■■■■■■■
function AddEffect(%Type, %Obj, %EffectID)
{
	switch(%Type)
	{
		case 1:
			//玩家
			%Obj.AddPacket( %EffectID );	//发送接受任务特效

		case 2:
			//怪物或NPC
			%Obj.AddPacket( %EffectID );	//发送接受任务特效
	}
}
//■■■■■■■■■■■指定对象发送特效编号■■■■■■■■■■■■■■■■■■

//■■■■■■■■■■■获取任务的类型■■■■■■■■■■■■■■■■■■■■■
function GetMissionKind(%Mid)
{
	     if( ( %Mid >=  1000 )&&( %Mid <=  8999 ) ){return 0;}	//"【门宗任务】"
	else if( ( %Mid >= 10000 )&&( %Mid <= 14999 ) ){return 1;}	//"【章回任务】"
	else if( ( %Mid >= 15000 )&&( %Mid <= 19999 ) ){return 2;}	//"【支线剧情】"
	else if( ( %Mid >= 20000 )&&( %Mid <= 20999 ) ){return 3;}	//"【每日循环】"
	else if( ( %Mid >= 21000 )&&( %Mid <= 21999 ) ){return 4;}	//"【帮会任务】"
	else if( ( %Mid >= 22000 )&&( %Mid <= 22999 ) ){return 5;}	//"【指引任务】"
	else if( ( %Mid >= 23000 )&&( %Mid <= 23999 ) ){return 6;}	//"【活动任务】"
	else if( ( %Mid >= 24000 )&&( %Mid <= 24999 ) ){return 7;}	//"【其它任务】"
	else return 0;
}
//■■■■■■■■■■■获取任务的类型■■■■■■■■■■■■■■■■■■■■■


//■■■■■■■■■■■获取数个不会重复的随机数■■■■■■■■■■■■■■■■
function GetRandomNum(%Num, %A, %Z)
{
	//根据Num来决定获取的随机数数量
	//A。随机数的起始数字
	//Z。随机数的结束数字

	%Temp = 0;				//临时记录
	%TempNum = 0;			//临时数组
	%Return_Num = "";	//最后返回的数值

	//循环指定Num次数
	for(%i = 0;%i < %Num;%i++)
	{
		//先随一个数
		%Temp = GetRandom(%A, %Z);

		//重置是否重复的数字
		%GameOver = 0;

		//判断此数是否与之前随的重复
		for(%ii = 0;%ii < %TempNum;%ii++)
		{
			if(%Temp == %TempNum[%ii + 1])
				%GameOver = 1;
		}

		//没有重复就保存当前的随机数
		if(%GameOver == 0)
			{
				%TempNum[%TempNum++] = %Temp;
				%Return_Num	= %Return_Num @ " " @ %Temp;
			}
			else
				%Num++;			//重复则需要多随机一次

//		echo("循环次数 = "@%i@" 随机数 = "@%Temp@" 是否重复 = "@%GameOver@" 已经随机到总数 = "@%TempNum);
	}

//	echo("汇总："@%Return_Num);
	return %Return_Num;
}
//■■■■■■■■■■■获取数个不会重复的随机数■■■■■■■■■■■■■■■■

//■■■■■■■■■■■玩家自己卜卦脚本■■■■■■■■■■■■■■■■■■■■
function Bugua(%Player)
{
	//判断多个条件

	//返回值，0默认失败
	//-1计时器数量满，失败
	//
	//成功返回相应的状态编号

	return 311450100;
}
//■■■■■■■■■■■玩家自己卜卦脚本■■■■■■■■■■■■■■■■■■■■

//■■■■■■■■■■■获取指定位的bit值■■■■■■■■■■■■■■■■■■■
function CheckBit(%num, %bit)
{
	return (%num & (1 << %bit)) != 0;
}
//■■■■■■■■■■■获取指定位的bit值■■■■■■■■■■■■■■■■■■■

















