//==================================================================================
//注：所有脚本开头，均需注明本脚本的大致说明文字
//
//
//客户端任务对话，【章回任务】第一卷支线任务
//==================================================================================

//【章回任务】
//第一编号为【卷】，每一张地图为一卷，每一卷的任务编号间隔数为200，第二编号段为【章】，每一卷暂定为三章，每一章的任务编号间隔数为40，附章间隔为20，最后多余20个编号。
//目前编号段规划，最大可至24卷，24*3=72章，即可以满足72张地图所需的章回任务，视后期任务需求，可挪用一部分的支线任务编号段


//■■■■■■■第一章■■■■■■■■■■■■■■■■■■■■
function Mission10220Dialog(%Npc, %Player, %Mid, %Tid)
{
	switch(%Tid)
	{
		case 10001:	return "<t>去找李员外谈谈，了解赵生的疑惑</t><b/>";
		case 10002:	return "<t>这位小仙……小生有一事相求，虽然难以启齿，但……小生实在是被逼无路了！</t><b/>" @
											"<t>城西的李员外的女儿芸儿与我相识数年，本到了谈婚论嫁之龄，但他家人突然对我闭门不见，态度冷淡陌生。小生实在琢磨不透，也不知发生了什么变故。</t><b/>" @
											"<t>唉，你能代我跑一趟吗？打听下芸儿家究竟发生了何事，在下感激不尽。</t><b/>";
		case 10005:	return "<t>赵生，那个书生啊……你告诉他，不要再来找我家芸儿了，芸儿病了，再也不要来我们家了。</t><b/>" @
											"<t>【李员外眼眶逐渐泛红】</t><b/>" @
											"<t>芸儿自从得了这个病，她的脸蛋变得……变得丑陋，不能见人……让赵生将我女儿忘了吧。</t><b/>";
	}
	return "Mission" @ %Mid @ "Dialog == 错误 Npc 【" @ %Npc @ "】Player【" @ %Player @ "】Mid【" @ %Mid @ "】Tid【" @ %Tid @ "】";
}

function Mission10221Dialog(%Npc, %Player, %Mid, %Tid)
{
	switch(%Tid)
	{
		case 10001:	return "<t>带着芸儿手绢去找赵生</t><b/>";
		case 10002:	return "<t>赵生又是何苦呢？芸儿此病十分怪异，脸生疮疾，模样也变了……唉，我那苦命的女儿啊！</t><b/>" @
											"<t>对了，我女儿让我把这张手绢交给赵生，你帮我交给他吧，就在我旁边的箱子上。</t><b/>" @
											"<t>唉，这是我李家触霉头，我不想他牵连在内，把芸儿忘了吧，她是决计无法再见人了。</t><b/>" @
											"<t>【李员外不停地擦拭着眼角】</t><b/>";
		case 10005:	return "<t>什么？芸儿得了怪病！不，不可能！前段时间她还好好的……</t><b/>" @
											"<t>一定是中了什么妖术，你再仔细给我讲讲，她症状如何？</t><b/>";
	}
	return "Mission" @ %Mid @ "Dialog == 错误 Npc 【" @ %Npc @ "】Player【" @ %Player @ "】Mid【" @ %Mid @ "】Tid【" @ %Tid @ "】";
}

function Mission10222Dialog(%Npc, %Player, %Mid, %Tid)
{
	switch(%Tid)
	{
		case 10001:	return "<t>去找陶药师了解芸的病况</t><b/>";
		case 10002:	return "<t>我与芸儿情深意重，我爱的是她的人，而非虚无的容貌。芸儿既患此疾，赵生怎能撒手不管？</t><b/>" @
											"<t>不管这病有多邪，哪怕最终无方可治，我也要伴她终老！</t><b/>" @
											"<t>小仙，陶药师是万灵城名气很大的神医，你能帮我去询问下吗？</t><b/>";
		case 10005:	return "<t>哦？面容变陋？生烂疮？容貌变异？这种病……我还是第一次听说……</t><b/>" @
											"<t>赵生那小伙还真有心，此忙我不得不帮，容我好生想想究竟是何病症。</t><b/>";
	}
	return "Mission" @ %Mid @ "Dialog == 错误 Npc 【" @ %Npc @ "】Player【" @ %Player @ "】Mid【" @ %Mid @ "】Tid【" @ %Tid @ "】";
}

function Mission10223Dialog(%Npc, %Player, %Mid, %Tid)
{
	switch(%Tid)
	{
		case 10001:	return "<t>将仙粉撒在下城区北的大树之下，然后摘下烈炎草交给陶药师</t><b/>";
		case 10002:	return "<t>这病着实怪异，想必是中邪……要用烈性的药逼出邪气，我这里的药材尚不足配置这个药方啊……</t><b/>" @
											"<t>这样吧，拿着这盒仙粉，将之倒在下城区北的大树之下，会长出一颗嫩苗，那可是仙草——烈炎草。有了它，芸儿的病则有希望！</t><b/>" @
											"<t>速去速回，赵生定然心急如焚。</t><b/>";
		case 10005:	return "<t>有了烈炎草，芸儿的病总算是有了希望，呵呵。</t><b/>" @
											"<t></t><b/>";
	}
	return "Mission" @ %Mid @ "Dialog == 错误 Npc 【" @ %Npc @ "】Player【" @ %Player @ "】Mid【" @ %Mid @ "】Tid【" @ %Tid @ "】";
}

function Mission10224Dialog(%Npc, %Player, %Mid, %Tid)
{
	switch(%Tid)
	{
		case 10001:	return "<t>把烈炎仙丹带给万灵城的赵生</t><b/>";
		case 10002:	return "<t>我已将药配好，可惜的是，此药药性猛烈，一旦服用，必然会噬病人之血，芸儿的身体，怕是经受不住啊！</t><b/>" @
											"<t>如果赵生愿意以血喂药，去了药的噬血之性，方能给芸儿服下。</t><b/>" @
											"<t>如何取舍，让赵生自己定夺，我只能帮这么多了。</t><b/>";
		case 10005:	return "<t>这颗仙丹能治好芸儿的病，也有可能要了她的命。不行，我不能让芸儿以身犯险！</t><b/>" @
											"<t>小仙，谢谢你，若非你仗义相助，我根本拿不到这颗仙丹。</t><b/>";
	}
	return "Mission" @ %Mid @ "Dialog == 错误 Npc 【" @ %Npc @ "】Player【" @ %Player @ "】Mid【" @ %Mid @ "】Tid【" @ %Tid @ "】";
}

function Mission10225Dialog(%Npc, %Player, %Mid, %Tid)
{
	switch(%Tid)
	{
		case 10001:	return "<t>看看赵生会如何应对此事</t><b/>";
		case 10002:	return "<t>我虽一介书生，但也是堂堂男儿，流血又有何惧？</t><b/>" @
											"<t>【赵生拔出腰间佩剑，迅疾在手上割了一道，再将烈炎仙丹放在手中】</t><b/>";
		case 10005:	return "<t>【赵生脸色苍白，看起来十分虚弱】</t><b/>" @
											"<t>仙丹已……不再噬血，咳咳，芸儿……芸儿有救了……</t><b/>" @
											"<t>【赵生苍白的嘴角抿起微笑】</t><b/>";
	}
	return "Mission" @ %Mid @ "Dialog == 错误 Npc 【" @ %Npc @ "】Player【" @ %Player @ "】Mid【" @ %Mid @ "】Tid【" @ %Tid @ "】";
}

function Mission10226Dialog(%Npc, %Player, %Mid, %Tid)
{
	switch(%Tid)
	{
		case 10001:	return "<t>把血红烈炎仙丹带给李员外</t><b/>";
		case 10002:	return "<t>小仙，咳咳……还……还要麻烦你一次……</t><b/>" @
											"<t>请你代我把这颗丹药送往李员外家，小生此刻……怕是不能走过去了……</t><b/>" @
											"<t>请勿担忧，我只是失血虚弱而已，芸儿的病紧要，请速速送去，在下感激不尽。</t><b/>";
		case 10005:	return "<t>这……这是什么！烈炎仙丹？此等神物是如何得来的？</t><b/>" @
											"<t>【李员外静静听你讲述了仙丹的经过，不禁大声感慨】</t><b/>" @
											"<t>赵生这孩子真是一片痴心！一片痴心啊！这等行为让老头我心生愧疚，其实芸儿哪有什么病，只是我想考验赵生对她是否真心罢了。</t><b/>";
	}
	return "Mission" @ %Mid @ "Dialog == 错误 Npc 【" @ %Npc @ "】Player【" @ %Player @ "】Mid【" @ %Mid @ "】Tid【" @ %Tid @ "】";
}

function Mission10227Dialog(%Npc, %Player, %Mid, %Tid)
{
	switch(%Tid)
	{
		case 10001:	return "<t>把血红烈炎仙丹带给李芸儿</t><b/>";
		case 10002:	return "<t>唉，我也知道这两个孩子一往情深，但将女儿就这么嫁出去，我还是……有点不放心。</t><b/>" @
											"<t>所以我想出这么一个计策，想考考赵生，看他对我女儿是否一片真心。不料这孩子如此痴诚，好！好！这个女婿我要定了！</t><b/>" @
											"<t>你将这个仙丹带给芸儿吧，这对她而言，是最珍贵的东西。</t><b/>";
		case 10005:	return "<t>呜呜……赵大哥还好么？他那么瘦弱，还干这种傻事……</t><b/>" @
											"<t>这些血，芸儿怎么忍心让他流……</t><b/>" @
											"<t>【芸儿又低声哭泣】</t><b/>" @
											"<t>我这就去找他，我要亲口给他说，芸儿想他、念他，他对我的好，我全都知道，我会照顾他生生世世。</t><b/>";
	}
	return "Mission" @ %Mid @ "Dialog == 错误 Npc 【" @ %Npc @ "】Player【" @ %Player @ "】Mid【" @ %Mid @ "】Tid【" @ %Tid @ "】";
}

//■■■■■■■第一章■■■■■■■■■■■■■■■■■■■■

//■■■■■■■第二章■■■■■■■■■■■■■■■■■■■■
function Mission10228Dialog(%Npc, %Player, %Mid, %Tid)
{
	switch(%Tid)
	{
		case 10001:	return "<t>去见何许念，和他谈谈</t><b/>";
		case 10002:	return "<t>好像你在这里的名气挺大的嘛，旁边有个叫何许念的村民整日唠叨着要见你，你干脆就去见见他吧，满足他那小小的愿望。</t><b/>";
		case 10005:	return "<t>哎呀！这不就是清风村除鬼的神仙吗！不对啊，我一直以为你有三个脑袋，八只手，十双腿的，怎么也和凡人一个样子？</t><b/>" @
											"<t>不管啦，总之终于见到神仙了，快讲讲，讲讲你当时怎么除鬼的，据说惊天动地啊，波涛汹涌啊！</t><b/>" @
											"<t>【何许念激动地不停叫喊】</t><b/>";
	}
	return "Mission" @ %Mid @ "Dialog == 错误 Npc 【" @ %Npc @ "】Player【" @ %Player @ "】Mid【" @ %Mid @ "】Tid【" @ %Tid @ "】";
}

function Mission10229Dialog(%Npc, %Player, %Mid, %Tid)
{
	switch(%Tid)
	{
		case 10001:	return "<t>杀掉螃蟹洞附近的青螯水妖和龙虾水妖后跟何许念对话</t><b/>";
		case 10002:	return "<t>神仙啊，你知道螃蟹洞吗？那是一个危险的地方，周围遍布了许多青螯水妖和龙虾水妖。这些水怪霸占了海滩，抢夺渔民财物，实在是无恶不作啊！</t><b/>" @
											"<t>你能去清理这些讨厌的东西，为民除害吗？</t><b/>";
		case 10005:	return "<t>这么快！神仙果然不同凡响，你的恩德，清风滨的村民永生难忘。</t><b/>";
	}
	return "Mission" @ %Mid @ "Dialog == 错误 Npc 【" @ %Npc @ "】Player【" @ %Player @ "】Mid【" @ %Mid @ "】Tid【" @ %Tid @ "】";
}

function Mission10230Dialog(%Npc, %Player, %Mid, %Tid)
{
	switch(%Tid)
	{
		case 10001:	return "<t>杀掉大力螯王和恶霸蟹妖、恶霸虾妖后，把巨钳带给何许念</t><b/>";
		case 10002:	return "<t>你刚才在那边应该看到了一只巨大的蟹妖，是那群妖怪的头目——大力螯王。杀了它才能让这片海滩得到真正的和平。</t><b/>" @
											"<t>神仙，小心点，大力螯王不会单独行动，它的跟班个个都是恶霸，将它们都干掉！</t><b/>" @
											"<t>记得把大力螯王的巨钳带回来，这次虽然危险些，但我会给你最丰厚的报酬！</t><b/>";
		case 10005:	return "<t>螯王的巨钳！你做到了，神仙之力，果然超出我的想象。在下对你的景仰，犹如那个滔滔……</t><b/>" @
											"<t>【何许念又激动不已】</t><b/>";
	}
	return "Mission" @ %Mid @ "Dialog == 错误 Npc 【" @ %Npc @ "】Player【" @ %Player @ "】Mid【" @ %Mid @ "】Tid【" @ %Tid @ "】";
}
//■■■■■■■第二章■■■■■■■■■■■■■■■■■■■■

//■■■■■■■第三章■■■■■■■■■■■■■■■■■■■■
function Mission10231Dialog(%Npc, %Player, %Mid, %Tid)
{
	switch(%Tid)
	{
		case 10001:	return "<t>带着残旧的信件去海边找渔民刘大洋</t><b/>";
		case 10002:	return "<t>这封残旧信件孤零零的躺在地上，用海藻包了起来。打开后发现纸张已经泛黄，字迹几乎都看不清了，依稀还能分辨一个名字：姝雅。</t><b/>" @
											"<t>看来这封信是写给一个叫姝雅的人，也许海滩边的渔民刘大洋知道些内情。</t><b/>";
		case 10005:	return "<t>姝雅？好久没听到这个名字了……唉，那个苦命的孩子……</t><b/>" @
											"<t>其实你已经早已见过她了，百年来，她一直都在这里，从未离开。</t><b/>" @
											"<t>那美丽的望夫灯，正是姝雅所化啊。</t><b/>";
	}
	return "Mission" @ %Mid @ "Dialog == 错误 Npc 【" @ %Npc @ "】Player【" @ %Player @ "】Mid【" @ %Mid @ "】Tid【" @ %Tid @ "】";
}

function Mission10232Dialog(%Npc, %Player, %Mid, %Tid)
{
	switch(%Tid)
	{
		case 10001:	return "<t>带着这封信去望夫灯找扫灯人甘婆婆</t><b/>";
		case 10002:	return "<t>你还是亲自去望夫灯看看吧，关于她的传说，那里的扫灯人甘婆婆会告诉你的。</t><b/>" @
											"<t>带着这封信，甘婆婆是扫灯人，她知道的比我们都多。</t><b/>" @
											"<t>望夫灯就在海滩边的山崖上，是清风滨最高的地方了。</t><b/>";
		case 10005:	return "<t>咳咳……我在这里扫了大半辈子的灯塔，来这里的人很多哩，但还是第一次有人提到姝雅。</t><b/>" @
											"<t>【甘婆婆接过信，晃了一眼笑道】</t><b/>" @
											"<t>小神仙，老婆子不识字的，这封信既然提到姝雅，肯定跟她有莫大关系。</t><b/>";
	}
	return "Mission" @ %Mid @ "Dialog == 错误 Npc 【" @ %Npc @ "】Player【" @ %Player @ "】Mid【" @ %Mid @ "】Tid【" @ %Tid @ "】";
}

function Mission10233Dialog(%Npc, %Player, %Mid, %Tid)
{
	switch(%Tid)
	{
		case 10001:	return "<t>听甘婆婆讲述关于望夫灯的故事</t><b/>";
		case 10002:	return "<t>望夫灯，这是一个真实的故事，几乎每个来清风滨的人都会被感动。</t><b/>" @
											"<t>呵呵，婆婆记不得已经给多少人说过这个故事了，你也想听听？</t><b/>";
		case 10005:	return "<t>这个故事流传了百年，姝雅的坚贞不渝，让每个人都更明白爱情的真谛。</t><b/>";
			
		case 200: return  $Icon[2] @ $Get_Dialog_GeShi[31204] @ "婆婆请讲</t>";
		case 201: return "<t>早在百年前，姝雅和他的丈夫居住在清风村，丈夫每天都会出海打鱼，而姝雅一到傍晚就会来到山崖，点燃一盏灯火，为丈夫照亮回家的路。</t><b/>"@
			               "<t>如此寒冬酷暑，有一晚，丈夫出海后却再也没有归来……</t><b/>";
		case 202: return  $Icon[2] @ $Get_Dialog_GeShi[31204] @ "难道是出了什么事？接下来呢？</t>";
		case 203: return "<t>唉，大家都能猜测到是怎么回事，姝雅想必也清楚，她只是默默流泪，却固执地守候在山崖边，捧着灯火，怎样也不离开。</t><b/>"@
										 "<t>那姑娘就这样整日哭泣，无论烈日寒雪，都痴痴守在山崖，等着自己的丈夫……</t><b/>";
		case 204: return  $Icon[2] @ $Get_Dialog_GeShi[31204] @ "可是，她丈夫也许已经……</t>";
		case 205: return"<t>姝雅相信自己的丈夫不会一言不发就留下她自己，她相信丈夫一定会归来，无论是人，还是魂……</t><b/>"@
										"<t>久而久之，她化成了石雕，手中依然捧着灯火，照亮大海，照亮回家的路。</t><b/>"@
										"<t>至始至终，她都没有放弃过啊！直到今日，从未放弃……</t><b/>";	
	}
	return "Mission" @ %Mid @ "Dialog == 错误 Npc 【" @ %Npc @ "】Player【" @ %Player @ "】Mid【" @ %Mid @ "】Tid【" @ %Tid @ "】";
}

function Mission10234Dialog(%Npc, %Player, %Mid, %Tid)
{
	if(%Player.GetSex() == 1)
		%Sex = "小伙子";
	else
		%Sex = "小丫头";

	switch(%Tid)
	{
		case 10001:	return "<t>从海盗虾兵和海盗蟹将身上寻找深海珍珠粉，再交给甘婆婆</t><b/>";
		case 10002:	return "<t>呵呵，" @ %Sex @ "，不管怎么说，我还是第一次看到关于姝雅的信。</t><b/>" @
											"<t>这些字迹是被海藻模糊了，我知道有一种神奇的东西，能清洗那些海藻，运气好的话，能让这封百年前的书信重现。</t><b/>" @
											"<t>有一种深海珍珠粉可以洗净海藻，那些海盗虾兵和海盗蟹将身上也许会有。这东西比较罕见，花点时间仔细找找。</t><b/>";
		case 10005:	return "<t>对，就是这个东西，呵呵。</t><b/>" @
											"<t>来，我试试能不能将海藻的污渍都擦掉。</t><b/>";
	}
	return "Mission" @ %Mid @ "Dialog == 错误 Npc 【" @ %Npc @ "】Player【" @ %Player @ "】Mid【" @ %Mid @ "】Tid【" @ %Tid @ "】";
}

function Mission10235Dialog(%Npc, %Player, %Mid, %Tid)
{
	switch(%Tid)
	{
		case 10001:	return "<t>阅读书信后和甘婆婆对话</t><b/>";
		case 10002:	return "<t>好像有用！呵呵，婆婆眼睛花了，看不清楚是什么。你仔细看看，顺便讲给我听听。</t><b/>" @
											"<t>唉，姝雅在这里等了一百年了，不知道这封信能不能帮她如愿。</t><b/>";
		case 10005:	return "<t>啊？原来是姝雅的画像？</t><b/>" @
											"<t>【听到你念出下方的名字，突然惊呼一声】</t><b/>" @
											"<t>什么！子陵？你再说清楚，真的是子陵？子陵就是姝雅的丈夫啊！</t><b/>";
	}
	return "Mission" @ %Mid @ "Dialog == 错误 Npc 【" @ %Npc @ "】Player【" @ %Player @ "】Mid【" @ %Mid @ "】Tid【" @ %Tid @ "】";
}

function Mission10236Dialog(%Npc, %Player, %Mid, %Tid)
{
	switch(%Tid)
	{
		case 10001:	return "<t>在望夫灯附近打开画像，给姝雅看看</t><b/>";
		case 10002:	return "<t>苍天有眼，这是姝雅和子陵的东西，错不了！</t><b/>" @
											"<t>过了一百年，经过你，子陵终于回来了。快，你快将它给姝雅，在望夫灯附近把画打开，让姝雅看看，子陵回来了，终于回来了……</t><b/>";
		case 10005:	return "<t>谢谢你……</t><b/>";
							
	}
	return "Mission" @ %Mid @ "Dialog == 错误 Npc 【" @ %Npc @ "】Player【" @ %Player @ "】Mid【" @ %Mid @ "】Tid【" @ %Tid @ "】";
}
//■■■■■■■第三章■■■■■■■■■■■■■■■■■■■■

//■■■■■■■第四章■■■■■■■■■■■■■■■■■■■■
function Mission10237Dialog(%Npc, %Player, %Mid, %Tid)
{
	switch(%Tid)
	{
		case 10001:	return "<t>击杀在清风滨作祟的妖物</t><b/>";
		case 10002:	return "<t>小神仙，你可知道为什么近来清风滨周围的妖物作祟的那么频繁？据说因为月宫中的玉兔趁着嫦娥娘娘不在私自下凡，在我们清风滨旁边开了山头做了山大王。</t><b/>"@
											 "<t>所以现在周围的妖物有了首领，经常伤人害畜，我们这些普通的村民还怎么活的下去啊！<t><b/>"@
											 "<t>小神仙，我知道你神通广大，求求你救救我们吧！玉兔素来狡猾，要知道玉兔在哪里，唯一的办法是击杀玉兔的手下，煞煞妖物的气焰，让玉兔主动现身！</t><b/>";
		case 10005:	return "<t>小神仙，你已经成功的激怒了玉兔，刚才玉兔派人来村子里给你下了战帖，这是玉兔留下来的飞行符，你要是不去，我们村子就遭殃了！</t><b/>";
	}
	return "Mission" @ %Mid @ "Dialog == 错误 Npc 【" @ %Npc @ "】Player【" @ %Player @ "】Mid【" @ %Mid @ "】Tid【" @ %Tid @ "】";
}
//■■■■■■■第四章■■■■■■■■■■■■■■■■■■■■