//==================================================================================
//注：所有脚本开头，均需注明本脚本的大致说明文字
//
//
//客户端与服务端共用的脚本函数，任务奖励信息
//==================================================================================

//任务接受，设置基础信息
function AddMissionAccepted(%Player, %Mid)
{
	%MissionData = "MissionData_" @ %Mid;

	%Player.SetMissionFlag(%Mid,1,1); //设置任务接受

	if(%Mid == 10749)
		%Player.SetFlagsByte(10,0);
//		
//	if(%Mid == 10000)
//		{
//			%Player.SetMissionFlag(%Mid, 9000, 10);	       //设置,怪物总数
//			%Player.SetMissionFlag(%Mid, 9100, 0); 				//设置,怪物当前数量
//    }
//    
	//设置是否需要杀怪
	if(%MissionData.MonsterKill !$= "0")
		for(%i = 0; %i < 9; %i++)
		{
			%Monster = GetWord(%MissionData.MonsterKill, %i * 2);
			%KillNum = GetWord(%MissionData.MonsterKill, %i * 2 + 1);

			if( (%Monster $= "")&&(%KillNum $= "") )
				break;
			else
				{
					%Player.SetMissionFlag(%Mid, 3100 + %i, %Monster);	//设置,怪物编号
					%Player.SetMissionFlag(%Mid, 3200 + %i, %KillNum);	//设置,怪物总数
					%Player.SetMissionFlag(%Mid, 3300 + %i, 0); 				//设置,怪物当前数量
				}
		}

	//设置是否需要使用道具触发的目标
	if(%MissionData.Target !$= "0")
		for(%i = 0; %i < 9; %i++)
		{
			%Target = GetWord(%MissionData.Target, %i * 2);
			%TarNum = GetWord(%MissionData.Target, %i * 2 + 1);

			if( (%Target $= "")&&(%TarNum $= "") )
				break;
			else
				{
					%Player.SetMissionFlag(%Mid, 1100 + %i, %Target);		//设置,目标编号
					%Player.SetMissionFlag(%Mid, 1200 + %i, %TarNum);		//设置,目标触发总数
					%Player.SetMissionFlag(%Mid, 1300 + %i, 0); 				//设置,目标触发当前数量
				}
		}

	//设置中途是否需要寻找目标
	if(%MissionData.NpcX !$= "0")
		for(%i = 0; %i < 9; %i++)
		{
			%NpcX    = GetWord(%MissionData.NpcX, %i * 2);
			%NpcXNum = GetWord(%MissionData.NpcX, %i * 2 + 1);

			if( (%NpcX $= "")&&(%NpcXNum $= "") )
				break;
			else
				{
					%Player.SetMissionFlag(%Mid, 1150 + %i, %NpcX);			//设置,目标编号
					%Player.SetMissionFlag(%Mid, 1250 + %i, %NpcXNum);	//设置,目标触发总数
					%Player.SetMissionFlag(%Mid, 1350 + %i, 0); 				//设置,目标触发当前数量
				}
		}

	//设置是否需要获取物品
	if(%MissionData.ItemGet !$= "0")
		for(%i = 0; %i < 9; %i++)
		{
			%ItemGet = GetWord(%MissionData.ItemGet, %i * 2);
			%GetNum  = GetWord(%MissionData.ItemGet, %i * 2 + 1);

			if( (%ItemGet $= "")&&(%GetNum $= "") )
				break;
			else
				{
					if(%Player.GetItemCount(%ItemGet) > %GetNum)
						%NowNum  = %GetNum;
					else
						%NowNum  = %Player.GetItemCount(%ItemGet);

					%Player.SetMissionFlag(%Mid, 2100 + %i, %ItemGet);	//设置,ITEM编号
					%Player.SetMissionFlag(%Mid, 2200 + %i, %GetNum);		//设置,ITEM获取总数
					%Player.SetMissionFlag(%Mid, 2300 + %i, %NowNum); 	//设置,ITEM获取当前数量
				}
		}

	//设置是否需要运输物品
	if(%MissionData.ItemDelete !$= "0")
		if(%MissionData.ItemAdd !$= "0")
			for(%i = 0; %i < 9; %i++)
			{
				%ItemAdd = GetWord(%MissionData.ItemAdd, %i * 2);
				%AddNum  = GetWord(%MissionData.ItemAdd, %i * 2 + 1);

				if( (%ItemAdd $= "")&&(%AddNum $= "") )
					break;
				else
					{
						if(%Player.GetItemCount(%ItemAdd) > %AddNum)
							%NowNum  = %AddNum;
						else
							%NowNum  = %Player.GetItemCount(%ItemAdd);

						%Player.SetMissionFlag(%Mid, 2150 + %i, %ItemAdd);	//设置,ITEM编号
						%Player.SetMissionFlag(%Mid, 2250 + %i, %AddNum);		//设置,ITEM运输总数
						%Player.SetMissionFlag(%Mid, 2350 + %i, %NowNum);		//设置,ITEM运输当前数量
					}
			}

//	//设置是否需要使用物品
//	if(%MissionData.ItemUse !$= "0")
//		for(%i = 0; %i < 9; %i++)
//		{
//			%ItemUse = GetWord(%MissionData.ItemUse, %i * 2);
//			%UseNum  = GetWord(%MissionData.ItemUse, %i * 2 + 1);
//
//			if( (%ItemUse $= "")&&(%UseNum $= "") )
//				break;
//			else
//				{
//					%Player.SetMissionFlag(%Mid, 2400 + %i, %ItemUse);	//设置,ITEM编号
//					%Player.SetMissionFlag(%Mid, 2500 + %i, %UseNum);		//设置,ITEM使用总数
//					%Player.SetMissionFlag(%Mid, 2600 + %i, 0); 				//设置,ITEM使用当前数量
//				}
//		}

	%Player.SetMissionFlag(%Mid, 4000,10002); //设置,对话编号
//	%Player.SetMissionFlag(%Mid,5000,); //设置,技能编号
//	%Player.SetMissionFlag(%Mid,6000,); //设置,状态编号
//	%Player.SetMissionFlag(%Mid,7000,); //设置,时间
	
	//纯粹数值计数
	%Step8X_Min = 0;
	%Step8X_Max = 0;
	
			if(%Mid == 10000){%Step8X_Min = %Player.GetLevel();%Step8X_Max = 10;}														//第一个任务-修仙之旅
			if(%Mid == 22002){%Step8X_Min = isLearnLivingSkill(%Player.GetPlayerID(), 501031001);%Step8X_Max = 1;}	//钓鱼		//生活技能任务
			if(%Mid == 22004){%Step8X_Min = isLearnLivingSkill(%Player.GetPlayerID(), 501061001);%Step8X_Max = 1;}	//狩猎
			if(%Mid == 22006){%Step8X_Min = isLearnLivingSkill(%Player.GetPlayerID(), 501051001);%Step8X_Max = 1;}	//采药
			if(%Mid == 22008){%Step8X_Min = isLearnLivingSkill(%Player.GetPlayerID(), 501041001);%Step8X_Max = 1;}	//种植
			if(%Mid == 22010){%Step8X_Min = isLearnLivingSkill(%Player.GetPlayerID(), 501021001);%Step8X_Max = 1;}	//伐木
			if(%Mid == 22012){%Step8X_Min = isLearnLivingSkill(%Player.GetPlayerID(), 501011001);%Step8X_Max = 1;}	//采矿	
		
	if(%Step8X_Max > 0)
		{
			%Player.SetMissionFlag(%Mid, 8100, %Step8X_Min); //设置,当前数值
			%Player.SetMissionFlag(%Mid, 8000, %Step8X_Max); //设置,最大数值
		}
		
	//文字描述	
	%WenZi_Min = 0;	
	
	if(%Mid == 10001){%WenZi_Min = 1;}
		
	if(%WenZi_Min > 0)
		{
			%Player.SetMissionFlag(%Mid, 9000, %WenZi_Min); //设置,文字描述
		}
		
	%Player.UpdateMission(%Mid);					//更新任务信息
	AddEffect(1, %Player, $SP_Effect[1]);	//发送接受任务特效

}

//任务结束，奖励与设置信息
function AddMissionReward(%Player, %Mid, %Param)
{
//	echo("AddMissionReward ＝ ");

	%PlayerID          = %Player.GetPlayerID();
	%MissionData       = "MissionData_" @ %Mid;
	%MissionRewardData = "MissionRewardData_" @ %Mid;

	//扣除任务获取道具
	for(%i = 0; %i < 9; %i++)
	{
		%ItemGet = %Player.GetMissionFlag(%Mid, 2100 + %i);
		%GetNum  = %Player.GetMissionFlag(%Mid, 2200 + %i);

//		echo("扣除任务获取道具= "@%i@" = ["@%ItemGet@"] = ["@%GetNum@"]");

		if( (%ItemGet > 0)&&(%GetNum > 0) )
			%Player.PutItem(%ItemGet,- %GetNum);
		else
			break;
//			DelItemFromInventory(%PlayerID, %ItemGet, %GetNum);
	}

	//扣除接任务时给的道具
	if(%MissionData.ItemAdd !$= "0")
		for(%i = 0; %i < 9; %i++)
		{
			%ItemAdd    = GetWord(%MissionData.ItemAdd,    %i * 2);
			%AddNum     = GetWord(%MissionData.ItemAdd,    %i * 2 + 1);
			%ItemDelete = GetWord(%MissionData.ItemDelete, 0);

//  			echo("扣除接任务时给的道具= "@%i@" = ["@%ItemAdd@"] = ["@%AddNum@"]");

			if( (%ItemAdd $= "")&&(%AddNum $= "") )
				break;

			if(%ItemDelete == 1)
				%Player.PutItem(%ItemAdd,- %AddNum);
//				DelItemFromInventory(%PlayerID, %ItemAdd, %AddNum);
		}

	//扣除任务使用道具
	if(%MissionData.ItemUse !$= "0")
		for(%i = 0; %i < 9; %i++)
		{
			%ItemUse = GetWord(%MissionData.ItemUse, %i * 2);
			%UseNum  = GetWord(%MissionData.ItemUse, %i * 2 + 1);

//			echo("扣除任务使用道具= "@%i@" = ["@%ItemUse@"] = ["@%UseNum@"]");

			if( (%ItemUse $= "")&&(%UseNum $= "") )
				break;
			else
				%Player.PutItem(%ItemUse,- %UseNum);
//				DelItemFromInventory(%PlayerID, %ItemUse, %UseNum);
		}

	//给选择性道具
	if(%MissionRewardData.ItemChose !$= "0")
		{
			%Set = 0;

			//判断性别限制
			if( (%Mid == 10103)||(%Mid == 10106)||(%Mid == 10163) )
				if(%Player.GetSex() == 2)
					%Set = 3;

      //判断门宗限制
      if(%Mid == 10127)
				{
					if(%Player.GetFamily() == 1){%Set = 0;}
					if(%Player.GetFamily() == 2){%Set = 2;}
					if(%Player.GetFamily() == 3){%Set = 4;}
					if(%Player.GetFamily() == 4){%Set = 6;}
					if(%Player.GetFamily() == 5){%Set = 8;}
					if(%Player.GetFamily() == 6){%Set = 10;}
					if(%Player.GetFamily() == 7){%Set = 12;}
					if(%Player.GetFamily() == 8){%Set = 14;}

				}

			%ItemChose = GetWord(%MissionRewardData.ItemChose, (%Param + %Set) * 2);
			%ChoseNum  = GetWord(%MissionRewardData.ItemChose, (%Param + %Set) * 2 + 1);

//			echo("给选择性道具= "@%i@" = ["@%ItemChose@"] = ["@%ChoseNum@"]");

			if( (%ItemChose !$= "")&&(%ChoseNum !$= "") )
				%Player.PutItem(%ItemChose,%ChoseNum);
//				AddItemToInventory(%PlayerID, %ItemChose, %ChoseNum);
		}

	//必给的道具
	if(%MissionRewardData.ItemSet !$= "0")
		for(%i = 0; %i < 9; %i++)
		{
			%ItemSet = GetWord(%MissionRewardData.ItemSet, %i * 2);
			%SetNum  = GetWord(%MissionRewardData.ItemSet, %i * 2 + 1);

//			echo("必给的道具= "@%i@" = ["@%ItemSet@"] = ["@%SetNum@"]");

			if( (%ItemSet $= "")&&(%SetNum $= "") )
				break;
			else
				%Player.PutItem(%ItemSet,%SetNum);
//				AddItemToInventory(%PlayerID, %ItemSet, %SetNum);
		}

	//增减道具，一次性操作
	%MissionItem = %Player.AddItem();
	if(!%MissionItem)
		{
			echo("物品数据错误！任务编号："@%Mid);
			return;
		}

	//给经验
//	echo("给经验 ＝ "@%MissionRewardData.Exp );
	if(%MissionRewardData.Exp > 0)
		%Player.AddExp( %MissionRewardData.Exp );

	//10级以内玩家自动升级
	if(%Player.GetLevel() < 10)
		if(%Player.GetExp() >= %Player.GetLevelExp())
			{
				%Player.AddExp(- %Player.GetLevelExp());
				%Player.AddLevel(1);
			}

	//给金钱
	if(%MissionRewardData.Money > 0)
		%Player.AddMoney( %MissionRewardData.Money , 1);
	//给金元
	if(%MissionRewardData.Yuan > 0)
		%Player.AddMoney( %MissionRewardData.Yuan , 2);
	//给元宝

	//给积分

	//给声望

	//给技能
	if(%MissionRewardData.Skill !$= "0")
		for(%i = 0; %i < 9; %i++)
		{
			%Skill = GetWord(%MissionRewardData.Skill, %i);

			if(%Skill $= "")
				break;
			else
				%Player.AddSkill(%Skill);
		}

	//给状态
	if(%MissionRewardData.Buff !$= "0")
		for(%i = 0; %i < 9; %i++)
		{
			%Buff = GetWord(%MissionRewardData.Buff, %i);

			if(%Buff $= "")
				break;
			else
				%Player.AddSkill(%Buff, 0);
		}

	//给特效
	AddEffect(1, %Player, $SP_Effect[2]);

	//设置任务完成
	%Player.SetMission(%Mid,1);

	//任务完成附加设置

	//学习生活技能
	if(%Mid == 22101){LearnLivingSkill(%Player,501011001);}//挖矿技能师
	if(%Mid == 22103){LearnLivingSkill(%Player,501031001);}//钓鱼技能师

}

//添加任务数据
function AddMissionData(%Mid, %PreMid, %Name, %Map, %Lv, %NpcA, %NpcX, %NpcZ, %ItemAdd, %ItemDelete, %MonsterKill, %ItemGet, %ItemUse, %Target, %X_Man)
{
	//拼装任务数据编号
	%DataID = "MissionData_" @ %Mid;
	
	%LvA     =  GetWord(%Lv, 0);			//接任务等级
	%LvZ     =  GetWord(%Lv, 1);			//交任务等级
	%JianYi  =  GetWord(%Lv, 2);			//任务建议等级
	%SeeA    =  GetWord(%Lv, 3);			//任务最小可视等级
	%SeeZ    =  GetWord(%Lv, 4);			//任务最大可视等级
	
	//创建任务数据
	new scriptObject(%DataID)
		{
			Mid         =  %Mid;        	//编号
			PreMid      =  %PreMid;     	//前置任务
			Name        =  %Name;       	//名称
			Map         =  %Map;        	//归属地图
			LvA         =  %LvA;         	//接任务等级
			LvZ         =  %LvZ;         	//交任务等级
			JianYi			=  %JianYi;				//任务建议等级
			SeeA				=  %SeeA;					//任务最小可视等级
			SeeZ				=  %SeeZ;					//任务最大可视等级
			NpcA        =  %NpcA;       	//起始NPC
			NpcX        =  %NpcX;       	//中途对话NPC
			NpcZ        =  %NpcZ;       	//结束NPC
			ItemAdd     =  %ItemAdd;    	//接受任务时给于的任务道具
			ItemDelete  =  %ItemDelete;   //交付时是否要扣除
			MonsterKill =  %MonsterKill;	//杀怪
			ItemGet     =  %ItemGet;    	//取物
			ItemUse     =  %ItemUse;    	//使用道具
			Target      =  %Target;     	//目标
			X_Man       =  %X_Man;     		//变身状态
		};

	//任务总数增加1
	$MissionCount++;

	//任务数据相应位设置任务Data数据
	$MissionData[$MissionCount] = %DataID;

	//添加至相应等级的任务编号数组中
	$MissionData_Lv[%LvA, $MissionData_Lv[%LvA]++ ] = %Mid;
//	if(strlen(%LvA) == 1){%LvA = "00" @ %LvA;}
//	if(strlen(%LvA) == 2){%LvA = "0" @ %LvA;}
//	eval("$MissionData_Lv_" @ %LvA @ "[$MissionData_Lv_" @ %LvA @ "++] = %Mid;");

	//添加至相应可视等级的任务编号数组中
	for(%i = %SeeA;%i < %SeeZ;%i++)
		$MissionData_See_Lv[%i, $MissionData_See_Lv[%i]++ ] = %Mid;
	
	//添加至相应地图编号的任务编号数组中
	$MissionData_Map[%Map, $MissionData_Map[%Map]++ ] = %Mid;
//	eval("$MissionData_Map_" @ %Map @ "[$MissionData_Map_" @ %Map @ "++] = %Mid;");

	//添加至相应起始NpcA编号的任务编号数组中
//			eval("$MissionData_NpcA_" @ %NpcAID @ "[$MissionData_NpcA_" @ %NpcAID @ "++] = %Mid;");
	for(%i = 0; %i < 9; %i++)
	{
		%NpcAID = GetWord(%NpcA,%i);
		if(%NpcAID !$= "")
			$MissionData_NpcA[%NpcAID, $MissionData_NpcA[%NpcAID]++ ] = %Mid;
		else
			break;
	}

	//添加至相应中途对话NpcX编号的任务编号数组中
//			eval("$MissionData_NpcX_" @ %NpcXID @ "[$MissionData_NpcX_" @ %NpcXID @ "++] = %Mid;");
	for(%i = 0; %i < 9; %i++)
	{
		%NpcXID = GetWord(%NpcX,%i);
		if(%NpcXID !$= "")
			$MissionData_NpcX[%NpcXID, $MissionData_NpcX[%NpcXID]++ ] = %Mid;
		else
			break;
	}

	//添加至相应结束NpcZ编号的任务编号数组中
//			eval("$MissionData_NpcZ_" @ %NpcZID @ "[$MissionData_NpcZ_" @ %NpcZID @ "++] = %Mid;");
	for(%i = 0; %i < 9; %i++)
	{
		%NpcZID = GetWord(%NpcZ,%i);
		if(%NpcZID !$= "")
			$MissionData_NpcZ[%NpcZID, $MissionData_NpcZ[%NpcZID]++ ] = %Mid;
		else
			break;
	}

	//添加至相应怪物编号的任务编号数组中
//			eval("$MissionData_MonsterKill_" @ %MonsterID @ "[$MissionData_MonsterKill_" @ %MonsterID @ "++] = %Mid;");
	for(%i = 0; %i < 30; %i++)
	{
		%MonsterID = GetWord(%MonsterKill,%i * 2);
		if(%MonsterID > 0)
			$MissionData_MonsterKill[%MonsterID, $MissionData_MonsterKill[%MonsterID]++ ] = %Mid;
		else
			break;
	}

	//添加至相应道具获取编号的任务编号数组中
//			eval("$MissionData_ItemGet_" @ %ItemGetID @ "[$MissionData_ItemGet_" @ %ItemGetID @ "++] = %Mid;");
	for(%i = 0; %i < 30; %i++)
	{
		%ItemGetID = GetWord(%ItemGet,%i * 2);
		if(%ItemGetID > 0)
			$MissionData_ItemGet[%ItemGetID, $MissionData_ItemGet[%ItemGetID]++ ] = %Mid;
		else
			break;
	}

	//添加至相应道具使用编号的任务编号数组中
//				eval("$MissionData_ItemUse_" @ %ItemUseID @ "[$MissionData_ItemUse_" @ %ItemUseID @ "++] = %Mid;");
	for(%i = 0; %i < 30; %i++)
	{
		%ItemUseID = GetWord(%ItemUse,%i * 2);
		if(%ItemUseID > 0)
			{
				$MissionData_ItemUse[%ItemUseID, $MissionData_ItemUse[%ItemUseID]++ ] = %Mid;

//				//添加此道具的使用目标
//				for(%ii = 0; %ii < 30; %ii++)
//				{
//					%TargetID = GetWord(%Target,%ii * 2);
//					if(%TargetID > 0)
//						eval("$MissionData_ItemUse_" @ %ItemUseID @ "_Target[%ii + 1] = %TargetID;");
//					else
//						break;
//				}
			}
		else
			break;
	}
}

//添加任务奖励数据
function AddMissionRewardData(%Mid, %NanDu, %JiFen, %Exp, %Money, %Yuan, %Gold, %ShengWang, %ItemChose, %ItemSet, %Skill, %Buff)
{
	//拼装任务数据编号
	%DataID = "MissionRewardData_" @ %Mid;

	//创建任务数据
	new scriptObject(%DataID)
		{
			NanDu       =  %NanDu;      	//难度
			JiFen       =  %JiFen;      	//积分
			Exp         =  %Exp;        	//经验
			Money       =  %Money;      	//金元
			Yuan        =  %Yuan;      		//灵元
			Gold        =  %Gold;       	//元宝
			ShengWang   =  %ShengWang;  	//声望
			ItemChose   =  %ItemChose;  	//选择性道具
			ItemSet     =  %ItemSet;    	//必给道具
			Skill       =  %Skill;      	//技能
			Buff        =  %Buff;       	//状态
		};
}

function Get_Lv_Mission(%Lv)
{
	$Lv_Mission = 0;
	
	%Num = 0;
	%Num = $MissionData_See_Lv[%L];

	for(%ii = 0; %ii < %Num; %ii++)
		$Lv_Mission[$Lv_Mission++] = $MissionData_See_Lv[%L, %ii + 1];
			
//
//	for(%i = -15; %i < 1; %i++)
//	{
//		echo("i = "@%i);
//		echo("Lv = "@%Lv + %i);

//		%L = %Lv + %i;
//
//		if(%L <= 1)
//			%L = 1;

//		if(strlen(%L) == 1){%L = "00" @ %L;}
//		if(strlen(%L) == 2){%L = "0" @ %L;}

//	}
//	for(%iii = 0; %iii < $Lv_Mission; %iii++)
//	echo("$Lv_Mission [" @ %iii + 1 @ "] = " @ $Lv_Mission[ %iii + 1]);
}

//创建任务数据，格式参看《神仙传》任务设计模板.xlsx

//特殊任务
AddMissionData(10000,0,"扬名万灵城",1001,"1 1 1 1 11",400001101,0,400001101,0,0,0,0,0,0,0);
AddMissionData(10001,10112,"灵兽鉴定",1001,"1 1 6 1 11",0,0,0,0,0,0,0,0,0,0);
//新手指引
AddMissionData(10100,0,"起点",1001,"1 1 1 1 11",400001101,0,400001062,0,0,0,0,0,0,0);
AddMissionData(10101,10100,"天书",1001,"1 1 2 1 11",400001062,0,400001101,0,0,0,0,0,0,0);
AddMissionData(10102,10101,"莲花大殿",1001,"1 1 2 1 11",400001101,0,400001119,0,0,0,0,0,0,0);
AddMissionData(10103,10102,"灵元大阵(一)",1001,"1 1 2 1 11",400001119,"400001122 1",400001119,0,0,0,0,0,0,0);
AddMissionData(10104,10103,"灵元大阵(二)",1001,"1 1 3 1 11",400001119,0,400001003,0,0,0,0,0,0,0);
AddMissionData(10106,10104,"灵元大阵(三)",1001,"1 1 4 1 11",400001003,0,400001004,0,0,0,0,0,0,0);
AddMissionData(10108,10106,"灵元大阵(四)",1001,"1 1 4 1 11",400001004,0,400001101,0,0,0,0,0,0,0);
AddMissionData(10109,10108,"灵元大阵(五)",1001,"1 1 5 1 11",400001101,"400001102 1",400001101,0,0,0,0,0,0,0);
AddMissionData(10110,10109,"补漏",1001,"1 1 5 1 11",400001101,0,400001119,0,0,0,0,0,0,0);
AddMissionData(10111,10110,"追寻灵兽",1001,"1 1 6 1 11",400001119,0,400001007,"108020265 1",1,0,0,0,0,0);
AddMissionData(10112,10111,"捆住灵兽",1001,"1 1 6 1 11",400001007,0,400001007,0,0,0,"108020273 1",0,0,0);
AddMissionData(10113,10112,"变身丹",1001,"1 1 6 1 11",400001007,0,400001001,"108020266 1",0,0,0,0,"108020266 1",0);
AddMissionData(10114,10113,"炼药(一)",1001,"1 1 7 1 11",400001001,0,400001001,"108020278 1",0,0,"107019001 1 108020267 1",0,0,0);
AddMissionData(10115,10114,"炼药(二)",1001,"1 1 7 1 11",400001001,0,400001060,"108020268 1",1,0,0,0,0,0);
AddMissionData(10116,10115,"炼药(三)",1001,"1 1 7 1 11",400001060,0,400001060,"108020269 1",0,0,"108020270 1",0,"108020271 1",0);
AddMissionData(10117,10116,"炼药(四)",1001,"1 1 8 1 11",400001060,0,400001001,"108020271 1",1,0,0,0,0,0);
AddMissionData(10118,10117,"新的试炼",1001,"1 1 8 1 11",400001001,0,400001101,0,0,0,0,0,0,0);
AddMissionData(10119,10118,"心灵的试炼",1001,"1 1 8 1 11",400001101,"400001101 1",400001101,0,0,0,0,0,0,0);
AddMissionData(10120,10119,"体魄的试炼",1001,"1 1 9 1 11",400001101,0,400001101,0,0,0,0,0,"810010119 1",0);
AddMissionData(10121,10120,"力量的试炼",1001,"1 1 9 1 11",400001101,0,400001101,0,0,"410900002 1 410900001 3","108020272 1",0,0,0);
AddMissionData(10122,0,"八大门宗",1001,"10 10 10 10 20",400001101,"400001042 1 400001041 1 400001039 1 400001038 1 400001040 1 400001043 1 400001044 1 400001045 1",0,0,0,0,0,0,0,0);
AddMissionData(10123,10122,"正宗之道",1001,"10 10 10 10 20",400001101,"400001102 1",0,0,0,0,0,0,0,0);
AddMissionData(10124,0,"新的神通",1001,"10 10 10 10 20",0,0,0,0,0,0,0,0,0,0);
AddMissionData(10125,10124,"破木",1001,"10 10 10 10 20",0,0,0,0,0,0,0,0,0,0);
AddMissionData(10126,10125,"属于你的任务",1001,"10 10 10 10 20",0,0,0,0,0,0,0,0,0,0);
AddMissionData(10127,10126,"相助同门弟子",1001,"10 10 10 10 20",0,0,0,0,0,0,0,0,0,0);
AddMissionData(10128,10127,"火眼金睛",1001,"10 10 10 10 20",0,0,0,0,0,0,0,0,0,0);

//第一卷
AddMissionData(10140,0,"清风村的怪事",1101,"11 11 10 10 20",400001059,0,400002102,0,0,0,0,0,0,0);
AddMissionData(10141,0,"赶走讨厌的兔子",1101,"11 11 10 10 20",400002102,0,400002102,0,0,"410700058 3",0,0,0,0);
AddMissionData(10142,10141,"黄鼬妖的尾巴",1101,"11 11 11 10 20",400002102,0,400002101,0,0,0,"108020051 3",0,0,0);
AddMissionData(10143,10142,"清风村的怪病",1101,"11 11 11 10 20",400002101,0,400002103,0,0,0,0,0,0,0);
AddMissionData(10144,10143,"除掉捣药兔妖",1101,"11 11 12 10 20",400002103,0,400002103,0,0,"410700060 3",0,0,0,0);
AddMissionData(10145,10144,"啃草大王",1101,"11 11 12 10 20",400002103,0,400002103,0,0,"410700061 1 410700076 4","108020053 1",0,0,0);
AddMissionData(10146,10145,"追查真相的人",1101,"11 11 13 10 20",400002103,0,400002104,"108020052 1",1,0,0,0,0,0);
AddMissionData(10147,10146,"收集污染物",1101,"11 11 13 10 20",400002104,0,400002104,0,0,0,"108020054 2 108020055 2",0,0,0);
AddMissionData(10148,10147,"痛杀小妖显神通",1101,"11 11 13 10 20",400002104,0,400002104,0,0,"410700077 3","108020056 2",0,0,0);
AddMissionData(10149,10148,"黄鼬内丹藏玄机",1101,"11 11 14 10 20",400002104,0,400002105,0,0,0,"108020057 1 108020058 1 108020059 1",0,0,0);
AddMissionData(10150,10149,"惨死废墟中",1101,"11 11 14 10 20",400002105,0,400002109,0,0,0,0,0,0,0);
AddMissionData(10151,10150,"绢巾记血书",1101,"11 11 14 10 20",400002109,0,108020060,"108020060 1",1,0,0,0,0,0);
AddMissionData(10152,10151,"遗恨",1101,"11 11 14 10 20",108020060,0,400002105,"108020060 1",0,0,0,0,0,0);
AddMissionData(10153,10152,"清风洒泪送绢巾",1101,"11 11 14 10 20",400002105,0,400001111,"108020060 1",1,0,0,0,0,0);
AddMissionData(10154,10153,"当黑暗降临",1001,"11 11 15 10 20",400001111,0,400001104,0,0,0,0,0,0,0);
AddMissionData(10155,10154,"当梦境再现",1001,"11 11 15 10 20",400001104,0,400001104,0,0,0,0,0,0,0);
AddMissionData(10156,10155,"当黄昏朦胧",1101,"11 11 15 10 20",400001104,0,400002105,0,0,0,0,0,0,0);
AddMissionData(10157,10156,"当拂晓渗透黑暗",1101,"11 11 15 10 20",400002105,0,400002112,0,0,"410700084 2 410700085 2",0,0,0,0);
AddMissionData(10158,10157,"古怪老神仙",1101,"11 11 16 10 20",400002112,0,400002112,0,0,0,"108020061 2 108020062 2",0,0,0);
AddMissionData(10159,10158,"灵螺的黏液",1101,"11 11 16 10 20",400002112,0,400002112,0,0,0,"108020063 3",0,0,0);
AddMissionData(10160,10159,"降鬼之物",1101,"11 11 16 10 20",400002112,0,400002105,"108020064 1",1,"410700087 1 410700088 1",0,0,0,0);
AddMissionData(10161,10160,"夜闯鬼村",1101,"11 11 17 10 20",400002105,0,401302001,0,0,0,0,0,0,0);
AddMissionData(10162,10161,"夜除鬼(一)",1101,"11 11 17 10 20",401302001,0,401302001,0,0,"410500062 2 410500063 2",0,0,0,0);
AddMissionData(10163,10162,"夜除鬼(二)",1101,"11 11 17 10 20",401302001,0,401302001,"108020016 1",1,0,"108020065 1",0,0,0);
AddMissionData(10164,10163,"夜除鬼(三)",1101,"11 11 17 10 20",401302001,0,401302001,"108020016 1",1,0,"108020066 1",0,0,0);
AddMissionData(10165,10164,"夜除鬼(四)",1101,"11 11 18 10 20",401302001,0,401302001,"108020016 1",1,0,"108020067 1",0,0,0);
AddMissionData(10166,10165,"一缕清风生死隔",1101,"11 11 18 10 20",400002105,0,400001111,0,0,0,0,0,0,0);
//第一卷第3章
AddMissionData(10180,10166,"还愿",1001,"11 11 18 10 20",400001111,0,400001112,"108020068 1",1,0,0,0,0,0);
AddMissionData(10181,10180,"为何闹鬼",1001,"11 11 18 10 20",400001112,0,400001113,0,0,0,0,0,0,0);
AddMissionData(10182,10181,"一骑卷千尘",1101,"11 11 18 10 20",400001113,0,400002111,0,0,0,0,0,0,0);
AddMissionData(10183,10182,"稍显神通荡小妖",1101,"11 11 19 10 20",400002111,0,400002106,0,0,"410700089 2 410700090 2",0,0,0,0);
AddMissionData(10184,10183,"螺虾一锅端",1101,"11 11 19 10 20",400002106,0,400002106,0,0,0,"108020069 1 108020070 1",0,0,0);
AddMissionData(10185,10184,"地缝中的阴气",1101,"11 11 19 10 20",400002106,0,400002110,"108020071 1",1,0,"108020072 1 108020073 1 108020074 1",0,0,0);
AddMissionData(10186,10185,"归鱼一动震阴阳",1101,"11 11 19 10 20",400002110,"400002110 1",400002110,0,0,0,0,0,0,0);
AddMissionData(10187,10186,"封印材料海中寻",1101,"11 11 20 10 20",400002110,0,400002106,0,0,0,"108020075 2 108020076 2 108020077 2",0,0,0);
AddMissionData(10188,10187,"灵镜再度封归鱼",1101,"11 11 20 10 20",400002106,0,400002106,"108020078 1",1,0,0,108020078,"811010103 1",0);
//第一卷支线附一章
AddMissionData(10220,0,"寻芸儿解牵挂",1001,"15 15 15 15 20",400001114,0,400001115,0,0,0,0,0,0,0);
AddMissionData(10221,10220,"小女生怪病",1001,"15 15 15 15 20",400001115,0,400001114,"108020249 1",1,0,0,0,0,0);
AddMissionData(10222,10221,"寻神医",1001,"15 15 15 15 20",400001114,0,400001116,0,0,0,0,0,0,0);
AddMissionData(10223,10222,"树下藏仙草",1001,"15 15 15 15 20",400001116,0,400001116,"108020259 1",1,0,"108020250 1",0,0,0);
AddMissionData(10224,10223,"治病仙丹",1001,"15 15 15 15 20",400001116,0,400001114,"108020251 1",1,0,0,0,0,0);
AddMissionData(10225,10224,"喂血显情深",1001,"15 15 15 15 20",400001114,0,400001114,0,0,0,0,0,0,0);
AddMissionData(10226,10225,"情系一线送仙丹",1001,"15 15 15 15 20",400001114,0,400001115,"108020253 1",1,0,0,0,0,0);
AddMissionData(10227,10226,"此物最相思",1001,"15 15 15 15 20",400001115,0,400001117,"108020253 1",1,0,0,0,0,0);
//第一卷支线附二章
AddMissionData(10228,0,"敬仰如滔滔江水",1101,"19 19 19 19 25",400002110,0,400002113,0,0,0,0,0,0,0);
AddMissionData(10229,10228,"海岸除妖",1101,"19 19 19 19 25",400002113,0,400002113,0,0,"410700096 2 410700098 2",0,0,0,0);
AddMissionData(10230,10229,"碧波荡群妖",1101,"19 19 19 19 25",400002113,0,400002113,0,0,"410700100 1 410700102 1 410700104 1","108020254 1",0,0,0);
//第一卷支线附三章
AddMissionData(10231,0,"奇怪的名字",1101,"19 19 19 19 25",400002117,0,400002114,"108020255 1",1,0,0,0,0,0);
AddMissionData(10232,10231,"望夫灯",1101,"19 19 19 19 25",400002114,0,400002115,"108020255 1",1,0,0,0,0,0);
AddMissionData(10233,10232,"从未逝去的故事",1101,"19 19 19 19 25",400002115,"400002115 1",400002115,0,0,0,0,0,0,0);
AddMissionData(10234,10233,"海中之物",1101,"19 19 19 19 25",400002115,0,400002115,0,0,0,"108020256 3",0,0,0);
AddMissionData(10235,10234,"迟来的书信",1101,"19 19 19 19 25",400002115,0,400002115,"108020257 1",1,0,0,0,0,0);
AddMissionData(10236,10235,"此情若深海",1101,"19 19 19 19 25",400002115,0,400002116,"108020258 1",1,0,0,0,"108020258 1",0);
//第一卷支线附四章
AddMissionData(10237,0,"捕兽任务-狡兔三窟",1101,"15 15 15 15 25",400002101,0,400002101,0,0,"410700058 5 410700086 5 410700077 5 410700094 5",0,0,0,0);

//第二卷第一章
AddMissionData(10300,0,"漫漫修神途",1101,"20 20 20 20 31",400002106,0,401102101,"108020090 1",1,0,0,0,0,0);
AddMissionData(10301,10300,"美味食材(一)",1102,"20 20 20 20 31",401102101,0,401102101,0,0,0,"108020091 5",0,0,0);
AddMissionData(10302,10301,"美味食材(二)",1102,"20 20 21 20 31",401102101,0,401102101,0,0,0,"108020092 5",0,0,0);
AddMissionData(10303,10302,"美味食材(三)",1102,"20 20 21 20 31",401102101,0,401102110,0,0,0,"108020093 1",0,0,0);
AddMissionData(10304,10303,"美味食材(四)",1102,"20 20 21 20 31",401102110,0,401102101,0,0,0,"108020094 1",0,0,0);
AddMissionData(10305,10304,"双龙戏珠",1102,"20 20 21 20 31",401102101,0,401102101,"108020095 1 108020096 1 108020097 1",0,0,"108020118 1",0,0,0);
AddMissionData(10306,10305,"超强猎人",1102,"20 20 22 20 31",401102101,0,401102110,0,0,0,0,0,0,0);
AddMissionData(10307,10306,"试炼：猎狐(一)",1102,"20 20 22 20 31",401102110,0,401102110,0,0,"411101004 5",0,0,0,0);
AddMissionData(10308,10307,"试炼：猎狐(二)",1102,"20 20 22 20 31",401102110,0,401102110,0,0,"411101005 5",0,0,0,0);
AddMissionData(10309,10308,"试炼：猎狐(三)",1102,"20 20 22 20 31",401102110,0,401102110,0,0,0,"108020098 1",0,0,0);
AddMissionData(10310,10309,"古镇有传说",1102,"20 20 23 20 31",401102110,0,401102111,0,0,0,0,0,0,0);
AddMissionData(10311,10310,"此地有仙踪",1102,"20 20 23 20 31",401102111,0,401102111,0,0,0,"108020099 5",0,0,0);
AddMissionData(10312,10311,"杀狐惹祸福",1102,"20 20 23 20 31",401102111,0,401102112,0,0,0,0,0,0,0);
AddMissionData(10313,10312,"美丽传说(一)",1102,"20 20 23 20 31",401102112,0,401102113,0,0,0,0,0,0,0);
AddMissionData(10314,10313,"美丽传说(二)",1102,"20 20 24 20 31",401102113,0,401102114,0,0,0,0,0,0,0);
AddMissionData(10315,10314,"美丽传说(三)",1102,"20 20 24 20 31",401102114,0,401102103,0,0,0,0,0,0,0);
AddMissionData(10316,10315,"美丽传说(四)",1102,"20 20 24 20 31",401102103,"401102103 1",401102103,0,0,0,0,0,0,0);
AddMissionData(10317,10316,"传说背后的秘密",1102,"20 20 24 20 31",401102103,0,401102112,0,0,0,0,0,0,0);
AddMissionData(10318,10317,"白狐内丹",1102,"20 20 24 20 31",401102112,0,401102112,0,0,0,"108020100 4",0,0,0);
AddMissionData(10319,10318,"雪牙",1102,"20 20 25 20 31",401102112,0,401102112,"108020101 1",1,0,"108020102 1",0,0,0);
AddMissionData(10320,10319,"魔之徊徨",1102,"20 20 25 20 31",401102112,0,401102115,0,0,0,0,0,0,0);
AddMissionData(10321,10320,"回到七日之前(一)",1102,"20 20 25 20 31",401102115,0,401304001,0,0,0,0,0,0,0);
AddMissionData(10322,10321,"回到七日之前(二)",1102,"20 20 25 20 31",401304001,0,401304002,0,0,0,0,0,0,0);
AddMissionData(10323,10322,"回到七日之前(三)",1102,"20 20 25 20 31",401304002,0,401304002,0,0,"411101009 6",0,0,0,0);
AddMissionData(10324,10323,"回到七日之前(四)",1102,"20 20 26 20 31",401304002,0,401304002,0,0,"410701002 3 410701001 3","108020103 1",0,0,0);
AddMissionData(10325,10324,"回到七日之前(五)",1102,"20 20 26 20 31",401304002,0,401304001,0,0,0,0,0,0,0);
AddMissionData(10326,10325,"有狐则灵焉",1102,"20 20 26 20 31",401102112,0,401102103,0,0,0,0,0,0,0);
AddMissionData(10327,10326,"童子悲无踪",1102,"20 20 26 20 31",401102103,0,401102125,0,0,"410701003 5",0,0,0,0);
//第二卷第二章
AddMissionData(10340,10327,"泣声谁人知",1102,"20 20 26 20 31",401102125,0,401102117,"108020104 1",1,0,0,0,0,0);
AddMissionData(10341,10340,"商小莲之父",1102,"20 20 27 20 31",401102117,0,401102106,"108020104 1",1,0,0,0,0,0);
AddMissionData(10342,10341,"浮云随风已百年(一)",1102,"20 20 27 20 31",401102106,0,401102106,0,0,"410701001 6",0,0,0,0);
AddMissionData(10343,10342,"浮云随风已百年(二)",1102,"20 20 27 20 31",401102106,0,401102106,"108020119 1",1,0,"108020105 1 108020106 1",108020119,0,0);
AddMissionData(10344,10343,"浮云随风已百年(三)",1102,"20 20 27 20 31",401102106,0,401102106,"108020107 1",1,0,0,0,"401102124 1",0);
//第二卷第三章
AddMissionData(10380,10344,"反击开始",1102,"20 20 28 20 31",401102106,0,401102118,0,0,"410701004 3 411101010 3",0,0,0,0);
AddMissionData(10381,10380,"幻变之术(一)",1102,"20 20 28 20 31",401102118,0,401102118,0,0,0,"108020109 5",0,0,0);
AddMissionData(10382,10381,"幻变之术(二)",1102,"20 20 28 20 31",401102118,0,401102118,0,0,0,"108020110 7",0,0,0);
AddMissionData(10383,10382,"幻变之术(三)",1102,"20 20 28 20 31",401102118,0,401102118,0,0,0,"108020111 6",0,0,0);
AddMissionData(10384,10383,"幻变之术(四)",1102,"20 20 29 20 31",401102118,0,401126001,0,0,0,0,0,0,0);
AddMissionData(10385,10384,"幻变之术(五)",1102,"20 20 29 20 31",401126001,0,401126001,0,0,"410701005 1 411101011 3 410701006 1",0,0,0,0);
AddMissionData(10386,10385,"幻变之术(六)",1102,"20 20 29 20 31",401126001,0,401102118,"108020112 1",1,0,"108020113 1",0,0,0);
AddMissionData(10387,10386,"一切就绪",1102,"20 20 29 20 31",401102118,0,401102106,"108020114 1",1,0,0,0,0,0);
AddMissionData(10388,10387,"伪装",1102,"20 20 29 20 31",401102106,0,401102120,"108020115 1",0,0,0,0,0,0);
AddMissionData(10389,10388,"扮狐妖见女童",1102,"20 20 30 20 31",401102120,0,401102108,"108020116 1",1,0,0,0,0,0);
AddMissionData(10390,10389,"扮妖狐杀妖狐",1102,"20 20 30 20 31",401102108,0,401102108,0,0,"410701012 6",0,0,0,0);
AddMissionData(10391,10390,"狐三大爷",1102,"20 20 30 20 31",401102108,0,401102107,0,0,0,0,0,0,0);
AddMissionData(10392,10391,"笑面狐",1102,"20 20 30 20 31",401102107,0,401102108,0,0,"410701008 1","108020117 1",0,0,0);
AddMissionData(10393,10392,"逃出狐仙居",1102,"20 20 30 20 31",401102108,0,401102108,0,0,0,0,0,0,0);
AddMissionData(10394,10393,"恩情难忘",1102,"20 20 31 20 31",401102108,0,401102106,0,0,0,"108020115 1",0,0,0);



//第三卷第一章
AddMissionData(10500,0,"通往世界另一端",1102,"32 32 32 32 43",401102106,0,400001037,0,0,0,0,0,0,0);
AddMissionData(10501,10500,"月幽境",1002,"32 32 32 32 43",400001037,0,401002101,0,0,0,0,0,0,0);
AddMissionData(10502,10501,"巨木之枝",1002,"32 32 32 32 43",401002101,0,401002102,"108020120 1",1,0,0,0,0,0);
AddMissionData(10503,10502,"得助修神人",1002,"32 32 32 32 43",401002102,0,401002103,0,0,0,0,0,0,0);
AddMissionData(10504,10503,"寻找手稿",1002,"32 32 32 32 43",401002103,0,401002103,0,0,0,"108020121 1",0,0,0);
AddMissionData(10505,10504,"无忧草野之谜",1103,"32 32 33 32 43",401002103,0,401103008,0,0,0,0,0,0,0);
AddMissionData(10506,10505,"灵力激崩(一)",1103,"32 32 33 32 43",401103008,0,401103008,0,0,0,"108020122 6",0,0,0);
AddMissionData(10507,10506,"灵力激崩(二)",1103,"32 32 33 32 43",401103008,0,401103008,0,0,0,"108020123 6",0,0,0);
AddMissionData(10508,10507,"灵力激崩(三)",1103,"32 32 33 32 43",401103008,0,401103008,"108020124 1",1,0,"108020125 6",0,0,0);
AddMissionData(10509,10508,"灵力激崩(四)",1103,"32 32 34 32 43",401103008,0,401103009,0,0,0,"108020126 5",0,0,0);
AddMissionData(10510,10509,"观察碧珠人",1103,"32 32 34 32 43",401103009,0,401103009,0,0,0,0,0,"811030110 1 811030111 1 811030112 1",0);
AddMissionData(10511,10510,"取回碧色灵珠",1103,"32 32 34 32 43",401103009,0,401103009,0,0,0,"108020127 5",0,0,0);
AddMissionData(10512,10511,"盗取",1103,"32 32 34 32 43",401103009,0,401103009,0,0,0,"108020128 4 108020129 4",0,0,0);
AddMissionData(10513,10512,"碧珠家园(一)",1103,"32 32 34 32 43",401103009,0,401103010,"108020130 1",0,0,0,0,"108020130 1",0);
AddMissionData(10514,10513,"碧珠家园(二)",1103,"32 32 35 32 43",401103010,0,401103010,"108020131 1 108020130 1",1,0,0,0,0,0);
AddMissionData(10515,10514,"碧珠家园(三)",1103,"32 32 35 32 43",401103010,0,401103011,0,0,0,0,0,0,0);
AddMissionData(10516,10515,"碧珠家园(四)",1103,"32 32 35 32 43",401103011,0,401103011,0,0,"411101015 1",0,0,0,0);
AddMissionData(10517,10516,"碧珠家园(五)",1103,"32 32 35 32 43",401103011,0,401103009,0,0,0,"108020134 7",0,0,0);
AddMissionData(10518,10517,"神圣之血(一)",1103,"32 32 35 32 43",401103009,0,401103012,0,0,0,"108020135 6",108020135,"552000038 1",0);
AddMissionData(10519,10518,"神圣之血(二)",1103,"32 32 36 32 43",401103012,0,401103024,0,0,0,"108020136 6",108020136,"552000039 1",0);
AddMissionData(10520,10519,"神圣之血(三)",1103,"32 32 36 32 43",401103024,0,401103025,0,0,0,"108020137 6",108020137,"552000040 1",0);
AddMissionData(10521,10520,"白桐",1103,"32 32 36 32 43",401103025,0,401103013,"108020138 1",1,0,0,0,0,0);
AddMissionData(10522,10521,"深入花海",1103,"32 32 36 32 43",401103013,0,401103013,0,0,"410400002 5 410400003 5",0,0,"811030113 1",0);
AddMissionData(10523,10522,"恢复自然平衡",1103,"32 32 37 32 43",401103013,0,401103013,"108020139 1",1,"410400005 1",0,0,0,0);
AddMissionData(10524,10523,"晋见散仙",1103,"32 32 37 32 43",401103013,0,401103014,"108020141 1",1,0,0,0,0,0);
AddMissionData(10525,10524,"三卷诗",1103,"32 32 37 32 43",401103014,0,401103014,0,0,0,"108020144 1 108020147 1 108020150 1 108020142 1 108020143 1 108020145 1 108020146 1 108020148 1 108020149 1",0,0,0);
AddMissionData(10526,10525,"佳酿",1103,"32 32 37 32 43",401103014,0,401103014,0,0,0,"108020151 3 108020152 3 108020153 4",0,0,0);
AddMissionData(10527,10526,"评酒",1103,"32 32 37 32 43",401103014,"401103020 1 401103021 1 401103015 1",401103015,0,0,0,0,0,0,0);
AddMissionData(10528,10527,"凤凰之恨(一)",1103,"32 32 38 32 43",401103015,0,401103015,0,0,"410400009 7",0,0,0,0);
AddMissionData(10529,10528,"凤凰之恨(二)",1103,"32 32 38 32 43",401103015,0,401103015,0,0,"410400011 1","108020155 1",0,0,0);
AddMissionData(10530,10529,"凤凰之恨(三)",1103,"32 32 38 32 43",401103015,0,401103015,"108020156 1",1,0,0,108020156,"552000041 1",0);
AddMissionData(10531,10530,"凤凰之恨(四)",1103,"32 32 38 32 43",401103015,0,401103016,0,0,0,0,0,0,0);
AddMissionData(10532,10531,"凤凰之恨(五)",1103,"32 32 38 32 43",401103016,0,401103016,0,0,0,"108020158 1",108020158,"552000042 1",0);
//第三卷第二章
AddMissionData(10540,10532,"弥补过错",1103,"32 32 39 32 43",401103016,0,401103016,0,0,410600003,"108020159 7",0,0,0);
AddMissionData(10541,10540,"晋见凤凰",1103,"32 32 39 32 43",401103016,0,401103017,"108020160 1 108020161 1",1,0,0,0,0,0);
AddMissionData(10542,10541,"吹出凤凰灵息",1103,"32 32 39 32 43",401103017,0,401103017,"108020162 1",1,0,0,108020162,"552000043 1",0);
AddMissionData(10543,10542,"灭花",1103,"32 32 39 32 43",401103017,0,401103017,0,0,0,"108020163 4 108020164 4",0,0,0);
AddMissionData(10544,10543,"打开花语牢笼",1103,"32 32 39 32 43",401103017,0,401103017,0,0,410400017,"108020165 1",108020165,"552000044 1",0);
AddMissionData(10545,10544,"三佛之宁(一)",1103,"32 32 40 32 43",401103017,0,401103018,0,0,0,0,0,0,0);
AddMissionData(10546,10545,"三佛之宁(二)",1103,"32 32 40 32 43",401103018,0,401103018,0,0,"410200002 5 410200003 5",0,0,0,0);
AddMissionData(10547,10546,"三佛之宁(三)",1103,"32 32 40 32 43",401103018,0,401103019,0,0,0,0,0,"811030106 1 811030107 1 811030108 1",0);
AddMissionData(10548,10547,"三佛之宁(四)",1103,"32 32 40 32 43",401103019,0,401103019,0,0,0,"108020166 3",0,0,0);
AddMissionData(10549,10548,"三佛之宁(五)",1103,"32 32 40 32 43",401103019,0,401103019,0,0,"410200005 1",0,0,0,0);
//第三卷第三章
AddMissionData(10580,10549,"凤凰火",1103,"32 32 41 32 43",401103019,0,401103017,"108020167 1",1,0,0,0,0,0);
AddMissionData(10581,10580,"三昧真火",1103,"32 32 41 32 43",401103017,0,401103017,0,0,0,"108020168 1 108020169 1",0,0,0);
AddMissionData(10582,10581,"凤凰涅磐",1103,"32 32 41 32 43",401103017,0,401103017,"108020170 1",1,0,0,108020170,401103017,0);
AddMissionData(10583,10582,"重回散仙居",1103,"32 32 41 32 43",401103017,0,401103014,"108020171 1",1,0,0,0,0,0);
AddMissionData(10584,10583,"贪狼星君的试炼",1103,"32 32 41 32 43",401103014,0,401305001,0,0,0,0,0,0,0);
AddMissionData(10585,10584,"试炼：妖蚊",1103,"32 32 42 32 43",401305001,0,401305001,0,0,"411101016 1",0,0,0,0);
AddMissionData(10586,10585,"试炼：河流精灵",1103,"32 32 42 32 43",401305001,0,401305001,0,0,"410600007 1",0,0,0,0);
AddMissionData(10587,10586,"试炼：碧珠人",1103,"32 32 42 32 43",401305001,0,401305001,0,0,"410701041 1",0,0,0,0);
AddMissionData(10588,10587,"试炼：花精",1103,"32 32 42 32 43",401305001,0,401305001,0,0,"410400019 1",0,0,0,0);
AddMissionData(10589,10588,"试炼：明王",1103,"32 32 42 32 43",401305001,0,401305001,0,0,"410200007 1",0,0,0,0);
AddMissionData(10590,10589,"参见酒剑仙",1103,"32 32 43 32 43",401103014,0,401002104,"108020172 1",1,0,0,0,0,0);

//第四卷第一章
AddMissionData(10700,0,"老酒送剑仙",1103,"43 43 43 43 54",401002104,0,401002104,0,0,0,"108020173 1",0,0,0);
AddMissionData(10701,10700,"月幽境的麻烦",1103,"43 43 43 43 54",401002104,0,401002105,0,0,0,0,0,0,0);
AddMissionData(10702,10701,"遮月之泪(一)",1103,"43 43 43 43 54",401002105,0,401002106,0,0,0,0,0,0,0);
AddMissionData(10703,10702,"遮月之泪(二)",1103,"43 43 43 43 54",401002106,0,401002105,0,0,0,0,0,0,0);
AddMissionData(10704,10703,"遮月之泪(三)",1103,"43 43 44 43 54",401002105,"401002106 1",401002105,0,0,0,"108020174 1",0,0,0);
AddMissionData(10705,10704,"遮月之泪(四)",1103,"43 43 44 43 54",401002105,0,401002107,"108020174 1",1,0,0,0,0,0);
AddMissionData(10706,10705,"遮月之泪(五)",1103,"43 43 44 43 54",401002107,0,401002107,"108020175 1",0,0,"108020176 1",0,"108020175 1",0);
AddMissionData(10707,10706,"遮月森林",1104,"43 43 44 43 54",401002107,0,401104001,0,0,0,0,0,0,0);
AddMissionData(10708,10707,"树枝化邪灵",1104,"43 43 44 43 54",401104001,0,401104001,0,0,0,"108020177 8",0,0,0);
AddMissionData(10709,10708,"深斑树枝精",1104,"43 43 45 43 54",401104001,0,401104001,0,0,0,"108020178 8",0,0,0);
AddMissionData(10710,10709,"邪化",1104,"43 43 45 43 54",401104001,0,401104002,0,0,0,"108020179 10",0,0,0);
AddMissionData(10711,10710,"幽枝林间生(一)",1104,"43 43 45 43 54",401104002,0,401104002,"108020180 1",1,0,0,0,"552000047 3",0);
AddMissionData(10712,10711,"幽枝林间生(二)",1104,"43 43 45 43 54",401104002,0,401104002,0,0,"410701043 10",0,0,0,0);
AddMissionData(10713,10712,"幽枝林间生(三)",1104,"43 43 45 43 54",401104002,0,401104002,0,0,0,"108020181 8 108020207 5",0,0,0);
AddMissionData(10714,10713,"幽枝林间生(四)",1104,"43 43 46 43 54",401104002,0,401104003,"108020182 1",1,0,0,0,0,0);
AddMissionData(10715,10714,"幽枝林间生(五)",1104,"43 43 46 43 54",401104003,0,401104003,0,0,"410400027 12",0,0,0,0);
AddMissionData(10716,10715,"幽枝林间生(六)",1104,"43 43 46 43 54",401104003,0,401104003,0,0,0,"108020183 3",0,0,0);
AddMissionData(10717,10716,"幽枝林间生(七)",1104,"43 43 46 43 54",401104003,0,401104003,"108020184 1",1,0,"108020185 1",0,0,0);
AddMissionData(10718,10717,"幽枝林间生(八)",1104,"43 43 47 43 54",401104003,0,401104003,0,0,0,0,0,0,0);
//第四卷第二章
AddMissionData(10740,10718,"精族长老",1104,"43 43 47 43 54",401104003,0,401104005,0,0,0,0,0,0,0);
AddMissionData(10741,10740,"烦人的絮叨",1104,"43 43 47 43 54",401104005,0,401104005,0,0,"410400033 1",0,0,0,0);
AddMissionData(10742,10741,"拿回根须",1104,"43 43 47 43 54",401104005,0,401104005,0,0,410400035,"108020186 12",0,0,0);
AddMissionData(10743,10742,"古老传说",1104,"43 43 47 43 54",401104005,"401104005 1",401104005,0,0,0,0,0,0,0);
AddMissionData(10744,10743,"花之雾",1104,"43 43 48 43 54",401104005,0,401104006,0,0,0,0,0,0,0);
AddMissionData(10745,10744,"不老药(一)",1104,"43 43 48 43 54",401104006,0,401104006,0,0,0,"108020187 5 108020188 5 108020189 5",0,0,0);
AddMissionData(10746,10745,"不老药(二)",1104,"43 43 48 43 54",401104006,0,401104005,0,0,0,0,0,0,0);
AddMissionData(10747,10746,"不老药(三)",1104,"43 43 48 43 54",401104005,0,401104007,0,0,0,0,0,0,0);
AddMissionData(10748,10747,"醉月之风",1104,"43 43 48 43 54",401104007,0,401104007,0,0,"410400041 10",0,0,0,0);
AddMissionData(10749,10748,"夜歌",1104,"43 43 48 43 54",401104007,0,401104007,0,0,"410400043 1","108020190 1",0,0,0);
AddMissionData(10750,10749,"五灵族人",1104,"43 43 49 43 54",401104007,0,401104008,0,0,0,0,0,0,0);
AddMissionData(10751,10750,"找回火药桶",1104,"43 43 49 43 54",401104008,0,401104008,0,0,0,"108020191 12",0,0,0);
AddMissionData(10752,10751,"轰隆！砰！",1104,"43 43 49 43 54",401104008,0,401104008,"108020192 1",1,"410400045 6",0,0,0,0);
AddMissionData(10753,10752,"黑色火药",1104,"43 43 49 43 54",401104008,0,401104009,"108020193 1",1,0,0,0,0,0);
AddMissionData(10754,10753,"烈焰焚烧",1104,"43 43 49 43 54",401104009,0,401104009,"108020194 1",1,"410400047 1",0,0,0,0);
AddMissionData(10755,10754,"奔月(一)",1104,"43 43 50 43 54",401104009,0,401104009,0,0,0,"108020195 1 108020196 1",0,0,0);
AddMissionData(10756,10755,"奔月(二)",1104,"43 43 50 43 54",401104009,0,401104009,0,0,0,"108020197 1",0,0,0);
AddMissionData(10757,10756,"奔月(三)",1104,"43 43 50 43 54",401104009,0,401104010,"108020198 1",1,0,0,0,0,0);
AddMissionData(10758,10757,"奔月(四)",1104,"43 43 50 43 54",401104010,0,401104011,0,0,0,0,0,0,0);
AddMissionData(10759,10758,"奔月(五)",1104,"43 43 50 43 54",401104011,0,401104011,0,0,"410600009 12",0,0,0,0);
AddMissionData(10760,10759,"奔月(六)",1104,"43 43 50 43 54",401104011,0,401104010,0,0,0,"108020199 1",0,0,0);
AddMissionData(10761,10760,"奔月(七)",1104,"43 43 51 43 54",401104010,0,401104010,0,0,"410400049 1 410400051 1",0,0,0,0);
//第四卷第三章
AddMissionData(10780,10761,"岌岌可危",1104,"43 43 51 43 54",401104010,0,401104013,"108020200 1",1,0,0,0,0,0);
AddMissionData(10781,10780,"反击前的准备",1104,"43 43 51 43 54",401104013,0,401104014,0,0,"410400053 6 410600013 6",0,0,0,0);
AddMissionData(10782,10781,"阴影笼罩",1104,"43 43 51 43 54",401104014,0,401104013,0,0,0,0,0,0,0);
AddMissionData(10783,10782,"暗香陨落",1104,"43 43 51 43 54",401104013,0,401104013,0,0,"410400055 1",0,0,0,0);
AddMissionData(10784,10783,"精族圣物(一)",1104,"43 43 52 43 54",401104013,0,401104015,0,0,0,0,0,0,0);
AddMissionData(10785,10784,"精族圣物(二)",1104,"43 43 52 43 54",401104015,0,401104016,0,0,"410600015 10",0,0,0,0);
AddMissionData(10786,10785,"精族圣物(三)",1104,"43 43 52 43 54",401104016,0,401104016,0,0,0,"108020201 1",0,0,0);
AddMissionData(10787,10786,"精族圣物(四)",1104,"43 43 52 43 54",401104016,0,401104016,0,0,"410600019 1","108020202 1",0,"552000022 1 552000023 1 552000024 1",0);
AddMissionData(10788,10787,"精族圣物(五)",1104,"43 43 52 43 54",401104016,0,401104015,"108020202 1",1,0,0,0,0,0);
AddMissionData(10789,10788,"森林之王的怒涛(一)",1104,"43 43 53 43 54",401104015,0,401104015,"108020202 1",1,0,"108020203 6",0,0,0);
AddMissionData(10790,10789,"森林之王的怒涛(二)",1104,"43 43 53 43 54",401104015,0,401104015,"108020202 1",1,0,"108020205 6",0,0,0);
AddMissionData(10791,10790,"森林之王的怒涛(三)",1104,"43 43 53 43 54",401104015,0,401104015,0,0,0,0,0,0,0);
AddMissionData(10792,10791,"森林之王的怒涛(四)",1104,"43 43 53 43 54",401104015,0,401104015,0,0,0,0,0,0,0);
AddMissionData(10793,10792,"森林之王的怒涛(五)",1104,"43 43 53 43 54",401104015,0,401104015,0,0,0,0,0,0,0);
AddMissionData(10794,10793,"森林之王的怒涛(六)",1104,"43 43 53 43 54",401104015,0,401104015,0,0,0,0,0,0,0);
AddMissionData(10795,10794,"向月幽城主报告",1104,"43 43 54 43 54",401104015,0,401002108,"108020206 1",1,0,0,0,0,0);

// 第五卷第一章
AddMissionData(10900,0,"踏入祝祭大泽",1002,"54 54 54 54 61",401002108,0,401002104,0,0,0,0,0,0,0);
AddMissionData(10901,10900,"毒之泥浆",1105,"54 54 54 54 61",401105001,0,401105001,0,0,0,"108020209 3",0,0,0);
AddMissionData(10902,10901,"毒液",1105,"54 54 54 54 61",401105001,0,401105001,0,0,0,"108020210 3",0,0,0);
AddMissionData(10903,10902,"超高温搅拌",1105,"54 54 54 54 61",401105001,0,401105001,"108020211 1",1,0,"108020212 1 108020213 1",0,0,0);
AddMissionData(10904,10903,"染疫巨物",1105,"54 54 54 54 61",401105001,0,401105002,"108020213 1",1,"410600036 1",0,0,0,0);
AddMissionData(10905,10904,"巫族（一）",1105,"54 54 55 54 61",401105002,0,401105002,0,0,0,"108020214 1",0,0,0);
AddMissionData(10906,10905,"巫族（二）",1105,"54 54 55 54 61",401105002,0,401105002,0,0,0,"108020215 1",0,0,0);
AddMissionData(10907,10906,"巫族（三）",1105,"54 54 55 54 61",401105002,0,401105002,"108020216 1",1,0,0,0,"401105003 5",0);
AddMissionData(10908,10907,"巫族（四）",1105,"54 54 55 54 61",401105002,0,401105004,"108020217 1",0,0,0,0,0,0);
AddMissionData(10909,10908,"巫族（五）",1105,"54 54 55 54 61",401105004,0,401105004,0,0,0,0,0,0,0);
AddMissionData(10910,10909,"忧心忡忡",1105,"54 54 56 54 61",401105004,0,401105002,0,0,"410600040 5",0,0,0,0);
AddMissionData(10911,10910,"古老族落",1105,"54 54 56 54 61",401105002,0,401105008,0,0,0,"108020218 3",0,0,0);
AddMissionData(10912,10911,"取得信任",1105,"54 54 56 54 61",401105008,0,401105008,0,0,"411200003 5",0,0,0,0);
AddMissionData(10913,10912,"生于邪面之下",1105,"54 54 56 54 61",401105008,0,401105008,0,0,0,"108020219 3",0,0,0);
AddMissionData(10914,10913,"面见族长",1105,"54 54 56 54 61",401105008,0,401105009,"108020220 1",1,0,0,0,0,0);
AddMissionData(10915,10914,"蛊惑（一）",1105,"54 54 57 54 61",401105009,0,401105009,0,0,0,0,0,0,0);
AddMissionData(10916,10915,"蛊惑（二）",1105,"54 54 57 54 61",401105009,0,401105009,0,0,0,"108020222 1 108020223 2 108020234 2",0,0,0);
AddMissionData(10917,10916,"蛊惑（三）",1105,"54 54 57 54 61",401105009,0,401105009,"108020225 1",1,"411101026 1",0,0,0,0);
AddMissionData(10918,10917,"一切为了信仰",1105,"54 54 57 54 61",401105009,0,401105011,0,0,0,"108020226 4",0,0,0);
AddMissionData(10919,10918,"魂灵的自由",1105,"54 54 57 54 61",401105011,0,401105011,0,0,"410500003 3",0,0,0,0);
AddMissionData(10920,10919,"窃取物资",1105,"54 54 58 54 61",401105011,0,401105012,0,0,0,"108020227 1",0,0,0);
AddMissionData(10921,10920,"烟火升腾",1105,"54 54 58 54 61",401105012,0,401105012,0,0,0,0,0,0,0);
AddMissionData(10922,10921,"时局急迫",1105,"54 54 58 54 61",401105012,0,401105011,0,0,0,0,0,0,0);
AddMissionData(10923,10922,"制蛊之术（一）",1105,"54 54 59 54 61",401105011,0,401105013,"108020228 1",1,0,0,0,0,0);
AddMissionData(10924,10923,"制蛊之术（二）",1105,"54 54 59 54 61",401105013,0,401105013,0,0,0,"108020229 1 108020230 1 108020231 3",0,0,0);
AddMissionData(10925,10924,"制蛊之术（三）",1105,"54 54 59 54 61",401105013,0,401105013,"108020232 1",0,0,0,0,0,0);
AddMissionData(10936,10925,"制蛊之术（四）",1105,"54 54 59 54 61",401105013,0,401105013,0,0,0,"108020223 1 108020224 1 108020235 1 108020225 1",0,0,0);
AddMissionData(10926,10936,"制蛊之术（五）",1105,"54 54 59 54 61",401105013,0,401105013,0,0,"411101032 1","108020237 1",0,0,0);
AddMissionData(10927,10926,"制蛊之术（六）",1105,"54 54 59 54 61",401105013,0,401105014,"108020238 1",1,0,0,0,0,0);
AddMissionData(10928,10927,"制蛊之术（七）",1105,"54 54 59 54 61",401105014,0,401105014,"108020239 1",1,0,0,0,0,0);
AddMissionData(10929,10928,"蛊术专精（一）",1105,"54 54 60 54 61",401105014,0,401307001,0,0,0,0,0,0,0);
AddMissionData(10930,10929,"蛊术专精（二）",1105,"54 54 60 54 61",401307001,0,401307001,"108020240 1 108020241 1",0,0,0,0,0,0);
AddMissionData(10931,10930,"蛊术专精（三）",1105,"54 54 60 54 61",401307001,0,401307001,"108020235 1",0,0,"108020244 1",0,0,0);
AddMissionData(10932,10931,"蛊术专精（四）",1105,"54 54 60 54 61",401307001,0,401307001,"108020235 1",0,0,"108020236 1",0,0,0);
AddMissionData(10933,10932,"蛊术专精（五）",1105,"54 54 60 54 61",401307001,0,401307001,"108020235 1",0,0,"108020248 1",0,0,0);
AddMissionData(10934,10933,"蛊术专精（六）",1105,"54 54 60 54 61",401307001,0,401307001,"108020244 1 108020236 1 108020248 1" ,0,"411200015 1 411200017 1",0,0,0,0);
AddMissionData(10935,10934,"蛊术专精（七）",1105,"54 54 60 54 61",401307001,0,401105009,0,0,0,0,0,0,0);


//生活技能指引任务
AddMissionData(22001,0,"寻访奇人-姜子牙",1001,"10 10 10 10 50",400001059,0,400001019,0,0,0,0,0,0,0);
AddMissionData(22002,0,"垂钓之术",1001,"10 10 10 10 50",400001019,0,400001019,"107059002 1",0,0,"106050101 2",0,0,0);
AddMissionData(22003,22002,"寻访奇人-夏心",1001,"10 10 10 10 50",400001019,0,400001022,0,0,0,0,0,0,0);
AddMissionData(22004,0,"狩猎之术",1001,"10 10 10 10 50",400001022,0,400001022,"107069002 1",0,0,"106060101 2",0,0,0);
AddMissionData(22005,0,"寻访奇人-何药乌",1102,"20 20 20 20 50",401102101,0,400001021,0,0,0,0,0,0,0);
AddMissionData(22006,0,"采药之术",1001,"20 20 20 20 50",400001021,0,400001021,"107019002 1",0,0,"106010101 2",0,0,0);
AddMissionData(22007,22006,"寻访奇人-柳素兰",1001,"20 20 20 20 50",400001021,0,400001020,0,0,0,0,0,0,0);
AddMissionData(22008,0,"种植之术",1001,"20 20 20 20 50",400001020,0,400001020,"107039002 1",0,0,"106030101 2",0,0,0);
AddMissionData(22009,0,"寻访奇人-鲁班",1002,"30 30 30 30 50",401002101,0,400001018,0,0,0,0,0,0,0);
AddMissionData(22010,0,"伐木之术",1001,"30 30 30 30 50",400001018,0,400001018,"107049002 1",0,0,"106040101 2",0,0,0);
AddMissionData(22011,22010,"寻访奇人-铁独山",1001,"30 30 30 30 50",400001018,0,400001017,0,0,0,0,0,0,0);
AddMissionData(22012,0,"挖矿之术",1001,"30 30 30 30 50",400001017,0,400001017,"107029002 1",0,0,"106020101 2",0,0,0);



//AddMissionData(22110,0,"生活技能——伐木",1001,115,15,400001019,0,400001019,0,0,0,0,0,0,0);
//AddMissionData(22112,0,"生活技能——种植",1001,120,20,400001022,0,400001022,0,0,0,0,0,0,0);
//AddMissionData(22113,0,"生活技能——采药",1001,120,20,400001020,0,400001020,0,0,0,0,0,0,0);
//AddMissionData(22114,0,"生活技能——狩猎",1001,120,20,400001021,0,400001021,0,0,0,0,0,0,0);

//AddMissionData(22101,0,"锻造(加工技能)",1001,35,35,400001026,0,400001026,0,0,0,0,0,0,0);
//AddMissionData(22102,0,"裁缝(加工技能)",1001,35,35,400001027,0,400001027,0,0,0,0,0,0,0);
//AddMissionData(22103,0,"工艺(加工技能)",1001,35,35,400001028,0,400001028,0,0,0,0,0,0,0);
//AddMissionData(22104,0,"符咒(加工技能)",1001,25,25,400001024,0,400001024,0,0,0,0,0,0,0);
//AddMissionData(22105,0,"炼丹(加工技能)",1001,25,25,400001025,0,400001025,0,0,0,0,0,0,0);
//AddMissionData(22106,0,"烹饪(加工技能)",1001,15,15,400001023,0,400001023,0,0,0,0,0,0,0);
//AddMissionData(22107,0,"工匠(加工技能)",1001,45,45,400001030,0,400001029,0,0,0,0,0,0,0);
//AddMissionData(22108,0,"蛊术(加工技能)",1001,45,45,400001031,0,400001030,0,0,0,0,0,0,0);

//AddMissionData(22115,0,"炼化(加工技能)",1001,45,45,400001029,0,400001029,0,0,0,0,0,0,0);


//创建任务奖励数据

//特殊任务
AddMissionRewardData(10000,1,0,10,0,1,0,0,0,0,0,0);
AddMissionRewardData(10001,1,0,0,0,50,0,0,0,"105110001 5 105120001 5",0,0);
//新手任务奖励
AddMissionRewardData(10100,1,0,60,9,0,0,0,0,"108020264 1 113010001 1 105099001 1",0,0);
AddMissionRewardData(10101,1,0,55,1,0,0,0,0,0,0,0);
AddMissionRewardData(10102,1,0,80,5,0,0,0,0,0,0,0);
AddMissionRewardData(10103,1,0,90,5,0,0,0,0,0,0,0);
AddMissionRewardData(10104,1,0,95,5,0,0,0,"101018000 1 101028000 1 101038000 1 101048000 1 101058000 1 101068000 1 101078000 1",0,0,0);
AddMissionRewardData(10106,1,0,115,3,0,0,0,"102028010 1 102028012 1 102028014 1 102028011 1 102028013 1 102028015 1",0,0,0);
AddMissionRewardData(10108,1,0,105,5,0,0,0,0,"102018000 1",200040001,0);
AddMissionRewardData(10109,1,0,250,11,0,0,0,0,"105020101 5",0,0);
AddMissionRewardData(10110,1,0,75,3,0,0,0,0,0,0,0);
AddMissionRewardData(10111,1,0,95,4,0,0,0,0,0,0,0);
AddMissionRewardData(10112,1,0,145,6,0,0,0,0,"118010002 1",0,0);
AddMissionRewardData(10113,1,0,155,6,0,0,0,0,"105028002 1",0,0);
AddMissionRewardData(10114,1,0,160,5,0,0,0,0,0,0,0);
AddMissionRewardData(10115,1,0,175,6,0,0,0,0,0,0,0);
AddMissionRewardData(10116,1,0,180,6,0,0,0,0,0,0,0);
AddMissionRewardData(10117,1,0,500,9,0,0,0,0,"105020121 5",0,0);
AddMissionRewardData(10118,1,0,250,5,0,0,0,0,0,0,0);
AddMissionRewardData(10119,1,0,260,5,0,0,0,0,0,0,0);
AddMissionRewardData(10120,1,0,380,7,0,0,0,0,0,0,0);
AddMissionRewardData(10121,1,0,500,7,0,0,0,0,0,0,0);
AddMissionRewardData(10122,1,0,450,8,0,0,0,0,0,0,0);
AddMissionRewardData(10123,1,0,455,11,0,0,0,0,0,0,0);
AddMissionRewardData(10124,1,0,460,12,0,0,0,0,0,0,0);
AddMissionRewardData(10125,1,0,470,12,0,0,0,0,0,0,0);
AddMissionRewardData(10126,1,0,480,12,0,0,0,0,0,0,0);
AddMissionRewardData(10127,1,0,505,26,0,0,0,"101078001 1 101058001 1 101068001 1 101018001 1 101028001 1 101018001 1 101038001 1 101058001 1 101038001 1 101048001 1 101078001 1 101018001 1 101028001 1 101048001 1 101068001 1 101048001 1",0,0,0);
AddMissionRewardData(10128,1,0,515,26,0,0,0,0,0,0,0);

//第一卷任务奖励
AddMissionRewardData(10140,1,0,65,11,0,0,0,0,0,0,0);
AddMissionRewardData(10141,1,0,250,43,0,0,0,0,0,0,0);
AddMissionRewardData(10142,1,0,270,20,0,0,0,0,0,0,0);
AddMissionRewardData(10143,1,0,70,0,0,0,0,0,"102018001 1",0,0);
AddMissionRewardData(10144,1,0,310,55,0,0,0,0,"105020101 5",0,0);
AddMissionRewardData(10145,1,0,780,127,0,0,0,0,"105020102 5",0,0);
AddMissionRewardData(10146,1,0,90,0,0,0,0,0,0,0,0);
AddMissionRewardData(10147,1,0,370,28,0,0,0,0,"102078011 1",0,0);
AddMissionRewardData(10148,1,0,430,26,0,0,0,0,0,0,0);
AddMissionRewardData(10149,1,0,730,39,0,0,0,0,0,0,0);
AddMissionRewardData(10150,1,0,95,0,0,0,0,0,0,0,0);
AddMissionRewardData(10151,1,0,100,0,0,0,0,0,0,0,0);
AddMissionRewardData(10152,1,0,135,0,0,0,0,0,0,0,0);
AddMissionRewardData(10153,1,0,200,50,0,0,0,0,"102048001 1",0,0);
AddMissionRewardData(10154,1,0,205,0,0,0,0,0,0,0,0);
AddMissionRewardData(10155,1,0,105,0,0,0,0,0,0,0,0);
AddMissionRewardData(10156,1,0,110,0,0,0,0,0,"105010101 5",0,0);
AddMissionRewardData(10157,1,0,520,27,0,0,0,0,"105010102 5",0,0);
AddMissionRewardData(10158,1,0,650,30,0,0,0,0,"102068001 1",0,0);
AddMissionRewardData(10159,1,0,665,31,0,0,0,"101018002 1 101028002 1 101038002 1 101048002 1 101058002 1 101068002 1 101078002 1",0,0,0);
AddMissionRewardData(10160,1,0,1255,58,0,0,0,0,"105020102 5",0,0);
AddMissionRewardData(10161,1,0,125,11,0,0,0,0,0,0,0);
AddMissionRewardData(10162,1,0,650,59,0,0,0,0,0,0,0);
AddMissionRewardData(10163,1,0,300,28,0,0,0,"102028016 1 102028018 1 102028020 1 102028017 1 102028019 1 102028021 1",0,0,0);
AddMissionRewardData(10164,1,0,320,29,0,0,0,0,"105020101 5",0,0);
AddMissionRewardData(10165,1,0,350,27,0,0,0,0,0,0,0);
AddMissionRewardData(10166,1,0,135,0,0,0,0,0,0,0,0);                       
AddMissionRewardData(10180,1,0,145,0,0,0,0,0,0,0,0);
AddMissionRewardData(10181,1,0,150,23,0,0,0,0,0,0,0);
AddMissionRewardData(10182,1,0,170,0,0,0,0,0,0,0,0);
AddMissionRewardData(10183,1,0,850,28,0,0,0,0,"102058001 1",0,0);
AddMissionRewardData(10184,1,0,870,28,0,0,0,0,0,0,0);
AddMissionRewardData(10185,1,0,550,18,0,0,0,0,0,0,0);
AddMissionRewardData(10186,1,0,150,0,0,0,0,0,0,0,0);
AddMissionRewardData(10187,1,0,960,38,0,0,0,0,0,0,0);
AddMissionRewardData(10188,1,0,2570,88,0,0,0,0,0,0,0);

//第一卷支线奖励
AddMissionRewardData(10220,1,0,780,0,13,0,0,0,0,0,0);
AddMissionRewardData(10221,1,0,805,0,13,0,0,0,0,0,0);
AddMissionRewardData(10222,1,0,850,0,12,0,0,0,0,0,0);
AddMissionRewardData(10223,1,0,1250,0,17,0,0,0,0,0,0);
AddMissionRewardData(10224,1,0,880,0,16,0,0,0,0,0,0);
AddMissionRewardData(10225,1,0,905,0,16,0,0,0,0,0,0);
AddMissionRewardData(10226,1,0,985,0,17,0,0,0,0,0,0);
AddMissionRewardData(10227,1,0,1050,0,18,0,0,0,0,0,0);
AddMissionRewardData(10228,1,0,1150,0,6,0,0,0,0,0,0);
AddMissionRewardData(10229,1,0,1680,0,9,0,0,0,0,0,0);
AddMissionRewardData(10230,1,0,3210,0,18,0,0,0,0,0,0);
AddMissionRewardData(10231,1,0,1080,0,6,0,0,0,0,0,0);
AddMissionRewardData(10232,1,0,1100,0,31,0,0,0,0,0,0);
AddMissionRewardData(10233,1,0,1160,0,33,0,0,0,0,0,0);
AddMissionRewardData(10234,1,0,1780,0,30,0,0,0,0,0,0);
AddMissionRewardData(10235,1,0,1190,0,20,0,0,0,0,0,0);
AddMissionRewardData(10236,1,0,1260,0,21,0,0,0,0,0,0);
AddMissionRewardData(10237,1,0,0,0,0,0,0,0,"113020019 1",0,0);
//第二卷奖励
AddMissionRewardData(10300,1,0,225,0,0,0,0,0,0,0,0);
AddMissionRewardData(10301,1,0,1370,55,0,0,0,0,0,0,0);
AddMissionRewardData(10302,1,0,1380,0,0,0,0,0,0,0,0);
AddMissionRewardData(10303,1,0,550,63,0,0,0,0,0,0,0);
AddMissionRewardData(10304,1,0,2580,0,0,0,0,0,"102018002 1",0,0);
AddMissionRewardData(10305,1,0,600,0,0,0,0,0,0,0,0);
AddMissionRewardData(10306,1,0,235,111,0,0,0,0,0,0,0);
AddMissionRewardData(10307,1,0,1395,0,0,0,0,0,0,0,0);
AddMissionRewardData(10308,1,0,1505,0,0,0,0,0,0,0,0);
AddMissionRewardData(10309,1,0,3090,250,0,0,0,0,"102078012 1",0,0);
AddMissionRewardData(10310,1,0,245,0,0,0,0,0,0,0,0);
AddMissionRewardData(10311,1,0,1090,0,0,0,0,0,0,0,0);
AddMissionRewardData(10312,1,0,250,0,0,0,0,0,0,0,0);
AddMissionRewardData(10313,1,0,255,0,0,0,0,0,0,0,0);
AddMissionRewardData(10314,1,0,260,0,0,0,0,0,0,0,0);
AddMissionRewardData(10315,1,0,265,0,0,0,0,0,0,0,0);
AddMissionRewardData(10316,1,0,1270,152,0,0,0,0,"102048011 1",0,0);
AddMissionRewardData(10317,1,0,280,0,0,0,0,0,0,0,0);
AddMissionRewardData(10318,1,0,1270,40,0,0,0,0,0,0,0);
AddMissionRewardData(10319,1,0,1510,0,0,0,0,"101018003 1 101028003 1 101038003 1 101048003 1 101058003 1 101068003 1 101078003 1",0,0,0);
AddMissionRewardData(10320,1,0,2260,120,0,0,0,0,0,0,0);
AddMissionRewardData(10321,1,0,265,0,0,0,0,0,0,0,0);
AddMissionRewardData(10322,1,0,270,0,0,0,0,0,0,0,0);
AddMissionRewardData(10323,1,0,1500,0,0,0,0,0,0,0,0);
AddMissionRewardData(10324,1,0,1700,0,0,0,0,0,0,0,0);
AddMissionRewardData(10325,1,0,2370,171,0,0,0,0,"102068002 1",0,0);
AddMissionRewardData(10326,1,0,275,0,0,0,0,0,0,0,0);
AddMissionRewardData(10327,1,0,1300,0,0,0,0,0,0,0,0);
AddMissionRewardData(10340,1,0,280,58,0,0,0,0,0,0,0);
AddMissionRewardData(10341,1,0,290,0,0,0,0,0,0,0,0);
AddMissionRewardData(10342,1,0,1790,0,0,0,0,0,0,0,0);
AddMissionRewardData(10343,1,0,1115,0,0,0,0,0,0,0,0);
AddMissionRewardData(10344,1,0,3280,227,0,0,0,0,"102028022 1",0,0);
AddMissionRewardData(10380,1,0,1900,70,0,0,0,0,0,0,0);
AddMissionRewardData(10381,1,0,1460,54,0,0,0,0,0,0,0);
AddMissionRewardData(10382,1,0,1930,0,0,0,0,0,0,0,0);
AddMissionRewardData(10383,1,0,1900,0,0,0,0,0,0,0,0);
AddMissionRewardData(10384,1,0,300,99,0,0,0,0,0,0,0);
AddMissionRewardData(10385,1,0,1550,0,0,0,0,0,0,0,0);
AddMissionRewardData(10386,1,0,7150,157,0,0,0,0,"102058002 1",0,0);
AddMissionRewardData(10387,1,0,310,0,0,0,0,0,0,0,0);
AddMissionRewardData(10388,1,0,620,0,0,0,0,0,0,0,0);
AddMissionRewardData(10389,1,0,330,0,0,0,0,0,0,0,0);
AddMissionRewardData(10390,1,0,2120,0,0,0,0,0,0,0,0);
AddMissionRewardData(10391,1,0,510,0,0,0,0,0,0,0,0);
AddMissionRewardData(10392,1,0,1710,102,0,0,0,0,0,0,0);
AddMissionRewardData(10393,1,0,1310,0,0,0,0,0,0,0,0);
AddMissionRewardData(10394,1,0,30000,675,0,0,0,0,"102018011 1",0,0);

//第三卷奖励
AddMissionRewardData(10500,1,0,335,0,0,0,0,0,0,0,0);
AddMissionRewardData(10501,1,0,340,0,0,0,0,0,0,0,0);
AddMissionRewardData(10502,1,0,350,0,0,0,0,0,0,0,0);
AddMissionRewardData(10503,1,0,360,0,0,0,0,0,0,0,0);
AddMissionRewardData(10504,1,0,3730,133,0,0,0,0,"102078013 1",0,0);
AddMissionRewardData(10505,1,0,345,0,0,0,0,0,0,0,0);
AddMissionRewardData(10506,1,0,5515,0,0,0,0,0,0,0,0);
AddMissionRewardData(10507,1,0,5525,0,0,0,0,0,0,0,0);
AddMissionRewardData(10508,1,0,5540,0,0,0,0,0,0,0,0);
AddMissionRewardData(10509,1,0,8890,498,0,0,0,0,"105020122 2",0,0);
AddMissionRewardData(10510,1,0,350,0,0,0,0,0,0,0,0);
AddMissionRewardData(10511,1,0,5690,151 ,0,0,0,0,0,0,0);
AddMissionRewardData(10512,1,0,2490,0,0,0,0,0,"102048012 1",0,0);
AddMissionRewardData(10513,1,0,356,0,0,0,0,0,0,0,0);
AddMissionRewardData(10514,1,0,1430,0,0,0,0,0,"105010124 5",0,0);
AddMissionRewardData(10515,1,0,370,0,0,0,0,"101018004 1 101028004 1 101038004 1 101048004 1 101058004 1 101068004 1 101078004 1",0,0,0);
AddMissionRewardData(10516,1,0,3150,145,0,0,0,0,0,0,0);
AddMissionRewardData(10517,1,0,10500,157,0,0,0,0,"102068003 1",0,0);
AddMissionRewardData(10518,1,0,5930,0,0,0,0,0,0,0,0);
AddMissionRewardData(10519,1,0,6100,0,0,0,0,0,"105020102 1",0,0);
AddMissionRewardData(10520,1,0,9150,217,0,0,0,0,0,0,0);
AddMissionRewardData(10521,1,0,380,0,0,0,0,0,0,0,0);
AddMissionRewardData(10522,1,0,6100,0,0,0,0,0,"102028023 1",0,0);
AddMissionRewardData(10523,1,0,3360,0,0,0,0,0,"105010104 5",0,0);
AddMissionRewardData(10524,1,0,400,223,0,0,0,0,0,0,0);
AddMissionRewardData(10525,1,0,3370,0,0,0,0,0,0,0,0);
AddMissionRewardData(10526,1,0,5140,108,0,0,0,0,0,0,0);
AddMissionRewardData(10527,1,0,10410,0,0,0,0,0,0,0,0);
AddMissionRewardData(10528,1,0,4720,0,0,0,0,0,0,0,0);
AddMissionRewardData(10529,1,0,3490,0,0,0,0,0,0,0,0);
AddMissionRewardData(10530,1,0,410,0,0,0,0,0,0,0,0);
AddMissionRewardData(10531,1,0,425,0,0,0,0,0,0,0,0);
AddMissionRewardData(10532,1,0,10250,518,0,0,0,0,0,0,0);
AddMissionRewardData(10540,1,0,4890,0,0,0,0,0,"102058003 1",0,0);
AddMissionRewardData(10541,1,0,425,0,0,0,0,0,0,0,0);
AddMissionRewardData(10542,1,0,430,0,0,0,0,0,0,0,0);
AddMissionRewardData(10543,1,0,6800,0,0,0,0,0,0,0,0);
AddMissionRewardData(10544,1,0,12615,322,0,0,0,0,0,0,0);
AddMissionRewardData(10545,1,0,440,0,0,0,0,0,0,0,0);
AddMissionRewardData(10546,1,0,7040,0,0,0,0,0,0,0,0);
AddMissionRewardData(10547,1,0,450,0,0,0,0,0,0,0,0);
AddMissionRewardData(10548,1,0,7050,0,0,0,0,0,0,0,0);
AddMissionRewardData(10549,1,0,13500,416,0,0,0,0,0,0,0);
AddMissionRewardData(10580,1,0,450,0,0,0,0,0,0,0,0);
AddMissionRewardData(10581,1,0,2200,0,0,0,0,0,0,0,0);
AddMissionRewardData(10582,1,0,480,0,0,0,0,0,0,0,0);
AddMissionRewardData(10583,1,0,6500,320,0,0,0,0,0,0,0);
AddMissionRewardData(10584,1,0,525,0,0,0,0,0,0,0,0);
AddMissionRewardData(10585,1,0,4580,0,0,0,0,0,0,0,0);
AddMissionRewardData(10586,1,0,4590,0,0,0,0,0,0,0,0);
AddMissionRewardData(10587,1,0,4595,0,0,0,0,0,0,0,0);
AddMissionRewardData(10588,1,0,4615,0,0,0,0,0,0,0,0);
AddMissionRewardData(10589,1,0,4635,0,0,0,0,0,0,0,0);
AddMissionRewardData(10590,1,0,105000,2108,0,0,0,0,0,0,0);

//第四卷奖励
AddMissionRewardData(10700,1,0,1170,0,0,0,0,0,"102078014 1",0,0);
AddMissionRewardData(10701,1,0,470,0,0,0,0,0,0,0,0);
AddMissionRewardData(10702,1,0,480,0,0,0,0,0,0,0,0);
AddMissionRewardData(10703,1,0,490,0,0,0,0,0,"102048013 1",0,0);
AddMissionRewardData(10704,1,0,4050,0,0,0,0,0,0,0,0);
AddMissionRewardData(10705,1,0,480,0,0,0,0,0,0,0,0);
AddMissionRewardData(10706,1,0,17190,474,0,0,0,0,"102058011 1",0,0);
AddMissionRewardData(10707,1,0,485,0,0,0,0,0,0,0,0);
AddMissionRewardData(10708,1,0,7630,0,0,0,0,0,0,0,0);
AddMissionRewardData(10709,1,0,7800,0,0,0,0,0,0,0,0);
AddMissionRewardData(10710,1,0,12500,490,0,0,0,0,"105010105 5",0,0);
AddMissionRewardData(10711,1,0,490,0,0,0,0,0,0,0,0);
AddMissionRewardData(10712,1,0,7810,0,0,0,0,0,0,0,0);
AddMissionRewardData(10713,1,0,8530,0,0,0,0,0,0,0,0);
AddMissionRewardData(10714,1,0,500,280,0,0,0,0,0,0,0);
AddMissionRewardData(10715,1,0,9475,0,0,0,0,0,"105020142 2",0,0);
AddMissionRewardData(10716,1,0,7980,0,0,0,0,0,0,0,0);
AddMissionRewardData(10717,1,0,4240,0,0,0,0,0,"105010125 5",0,0);
AddMissionRewardData(10718,1,0,25000,868,0,0,0,0,"102028024 1",0,0);
AddMissionRewardData(10740,1,0,520,0,0,0,0,0,0,0,0);
AddMissionRewardData(10741,1,0,4300,0,0,0,0,0,0,0,0);
AddMissionRewardData(10742,1,0,9610,0,0,0,0,0,0,0,0);
AddMissionRewardData(10743,1,0,520,0,0,0,0,0,0,0,0);
AddMissionRewardData(10744,1,0,15700,633,0,0,0,0,0,0,0);
AddMissionRewardData(10745,1,0,9820,0,0,0,0,0,0,0,0);
AddMissionRewardData(10746,1,0,520,0,0,0,0,0,0,0,0);
AddMissionRewardData(10747,1,0,12500,370,0,0,0,0,0,0,0);
AddMissionRewardData(10748,1,0,8270,0,0,0,0,0,0,0,0);
AddMissionRewardData(10749,1,0,12150,0,0,0,0,0,0,0,0);
AddMissionRewardData(10750,1,0,530,340,0,0,0,0,0,0,0);
AddMissionRewardData(10751,1,0,10030,0,0,0,0,0,0,0,0);
AddMissionRewardData(10752,1,0,5280,0,0,0,0,0,0,0,0);
AddMissionRewardData(10753,1,0,530,0,0,0,0,0,"105020142 2",0,0);
AddMissionRewardData(10754,1,0,22300,623,0,0,0,0,0,0,0);
AddMissionRewardData(10755,1,0,2160,0,0,0,0,0,0,0,0);
AddMissionRewardData(10756,1,0,8620,0,0,0,0,0,0,0,0);
AddMissionRewardData(10757,1,0,540,0,0,0,0,0,"102068005 1",0,0);
AddMissionRewardData(10758,1,0,555,309,0,0,0,0,0,0,0);
AddMissionRewardData(10759,1,0,10240,337,0,0,0,0,0,0,0);
AddMissionRewardData(10760,1,0,4580,0,0,0,0,0,0,0,0);
AddMissionRewardData(10761,1,0,29990,1058,0,0,0,"101018006 1 101028006 1 101038006 1 101048006 1 101058006 1 101068006 1 101078006 1",0,0,0);
AddMissionRewardData(10780,1,0,1375,0,0,0,0,0,0,0,0);
AddMissionRewardData(10781,1,0,10450,0,0,0,0,0,0,0,0);
AddMissionRewardData(10782,1,0,550,0,0,0,0,0,"105010123 1",0,0);
AddMissionRewardData(10783,1,0,10220,674,0,0,0,0,0,0,0);
AddMissionRewardData(10784,1,0,560,0,0,0,0,0,0,0,0);
AddMissionRewardData(10785,1,0,8980,0,0,0,0,0,0,0,0);
AddMissionRewardData(10786,1,0,4770,287,0,0,0,0,0,0,0);
AddMissionRewardData(10787,1,0,4800,0,0,0,0,0,0,0,0);
AddMissionRewardData(10788,1,0,16000,417,0,0,0,0,0,0,0);
AddMissionRewardData(10789,1,0,2240,0,0,0,0,0,"105010125 5",0,0);
AddMissionRewardData(10790,1,0,2260,0,0,0,0,0,0,0,0);
AddMissionRewardData(10791,1,0,1430,0,0,0,0,0,0,0,0);
AddMissionRewardData(10792,1,0,1630,0,0,0,0,0,0,0,0);
AddMissionRewardData(10793,1,0,1730,0,0,0,0,0,0,0,0);
AddMissionRewardData(10794,1,0,21000,664  ,0,0,0,0,"102058012 1",0,0);
AddMissionRewardData(10795,1,0,400000,14000,0,0,0,0,0,0,0);

//第五章奖励
AddMissionRewardData(10900,1,0,11925,0,1153,0,0,0,0,0,0);
AddMissionRewardData(10901,1,0,23055,0,2229,0,0,0,0,0,0);
AddMissionRewardData(10902,1,0,23055,0,2229,0,0,0,0,0,0);
AddMissionRewardData(10903,1,0,24500,0,2369,0,0,0,0,0,0);
AddMissionRewardData(10904,1,0,19800,0,1914,0,0,0,0,0,0);
AddMissionRewardData(10905,1,0,23650,0,3210,0,0,0,"105020142 2",0,0);
AddMissionRewardData(10906,1,0,20375,0,2766,0,0,0,0,0,0);
AddMissionRewardData(10907,1,0,18745,0,2545,0,0,0,0,0,0);
AddMissionRewardData(10908,1,0,15485,0,2102,0,0,0,0,0,0);
AddMissionRewardData(10909,1,0,20750,0,2817,0,0,0,0,0,0);
AddMissionRewardData(10910,1,0,24070,0,3294,0,0,0,"105020123 2",0,0);
AddMissionRewardData(10911,1,0,21000,0,2874,0,0,0,0,0,0);
AddMissionRewardData(10912,1,0,21505,0,2943,0,0,0,0,0,0);
AddMissionRewardData(10913,1,0,22000,0,3011,0,0,0,0,0,0);
AddMissionRewardData(10914,1,0,20105,0,2751,0,0,0,0,0,0);
AddMissionRewardData(10915,1,0,20900,0,3274,0,0,0,"105010106 5",0,0);
AddMissionRewardData(10916,1,0,21125,0,3309,0,0,0,0,0,0);
AddMissionRewardData(10917,1,0,18950,0,2968,0,0,0,0,0,0);
AddMissionRewardData(10918,1,0,22050,0,3454,0,0,0,0,0,0);
AddMissionRewardData(10919,1,0,22050,0,3454,0,0,0,0,0,0);
AddMissionRewardData(10920,1,0,20580,0,6292,0,0,0,"105010125 5",0,0);
AddMissionRewardData(10921,1,0,25800,0,7888,0,0,0,0,0,0);
AddMissionRewardData(10922,1,0,13200,0,4036,0,0,0,0,0,0);
AddMissionRewardData(10923,1,0,14500,0,2519,0,0,0,0,0,0);
AddMissionRewardData(10924,1,0,20010,0,3476,0,0,0,0,0,0);
AddMissionRewardData(10925,1,0,13300,0,2310,0,0,0,0,0,0);
AddMissionRewardData(10936,1,0,25600,0,3643,0,0,0,0,0,0);
AddMissionRewardData(10926,1,0,25520,0,4433,0,0,0,0,0,0);
AddMissionRewardData(10927,1,0,16720,0,2904,0,0,0,0,0,0);
AddMissionRewardData(10928,1,0,26000,0,4516,0,0,0,"102068006 1",0,0);
AddMissionRewardData(10929,1,0,17100,0,3210,0,0,0,0,0,0);
AddMissionRewardData(10930,1,0,17500,0,3285,0,0,0,0,0,0);
AddMissionRewardData(10931,1,0,22050,0,4139,0,0,0,0,0,0);
AddMissionRewardData(10932,1,0,23200,0,4355,0,0,0,"105010106 5",0,0);
AddMissionRewardData(10933,1,0,23500,0,4411,0,0,0,0,0,0);
AddMissionRewardData(10934,1,0,17800,0,3341,0,0,0,0,0,0);
AddMissionRewardData(10935,1,0,17500,0,3285,0,0,0,0,0,0);

//生活技能指引任务
AddMissionRewardData(22001,1,0,0,0,50,0,0,0,0,0,0);
AddMissionRewardData(22002,1,0,0,0,50,0,0,0,"107059003 1",0,0);
AddMissionRewardData(22003,1,0,0,0,50,0,0,0,0,0,0);
AddMissionRewardData(22004,1,0,0,0,50,0,0,0,"107069003 1",0,0);
AddMissionRewardData(22005,1,0,0,0,100,0,0,0,0,0,0);
AddMissionRewardData(22006,1,0,0,0,100,0,0,0,"107019003 1 105020001 2 105020002 2",0,0);
AddMissionRewardData(22007,1,0,0,0,100,0,0,0,0,0,0);
AddMissionRewardData(22008,1,0,0,0,100,0,0,0,"107039003 1 105020003 2 105020004 2",0,0);
AddMissionRewardData(22009,1,0,0,0,300,0,0,0,0,0,0);
AddMissionRewardData(22010,1,0,0,0,300,0,0,0,"107049003 1",0,0);
AddMissionRewardData(22011,1,0,0,0,300,0,0,0,0,0,0);
AddMissionRewardData(22012,1,0,0,0,300,0,0,0,"107029003 1",0,0);



//删除数据命令
//%DataID.delete();
