//==================================================================================
//客户端所有的脚本入口，只存脚本加载路径的添加，每添加一个脚本，均需注明脚本的大致内容
//==================================================================================


//==================================================================================
echo("开始载入脚本ClientMission");

//加载脚本标识，标明当前为客户端脚本
$Now_Script = 1;

//加载客户端与服务端共享的函数集-包括共享的脚本文件
Exec("./C_S/C_S_Function.cs");

//加载函数脚本集
Exec("./Client/C_Function.cs");

//加载普通对话脚本集
Exec("./Client/C_Dialog_Other.cs");

//加载任务对话脚本集
Exec("./Client/C_Dialog_Mission.cs");

//加载副本对话脚本
Exec("./Client/C_Dialog_CopyMap.cs");

//加载任务界面相关集
Exec("./Client/C_Mission_UI.cs");

echo("结束载入脚本ClientMission");
//=============================================================================
